[ {
  "created" : 1297258137000,
  "id" : "lxqnqypfbwb",
  "name" : "Reunion mensual del grupo",
  "status" : "past",
  "yes_rsvp_count" : 37,
  "venueName" : "Oficina de MuleSoft",
  "venueAddress" : "25 de Mayo 555 piso 9",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/16501716/",
  "description" : "<p>Se hace en la oficina de MuleSoft con un limite de 40 participantes.</p> <p>Formato inicial de las reuniones mensuales<br/>1) 30 mins conocerse, hablar y dar tiempo a que lleguen todos. Objetivo, todos hablar con todos. Preséntense, o presenten a los que conocen. Queremos que todos se conozcan y se sientan libres de hablar y proponer.<br/>2) 10-15 mins Presentación. Agradecer ayuda de personas y sponsors.<br/>3) 20-30 mins. Charlas rapidas. 5-10 temas unos 2 a 5 minutos entre todos. Piensen temas para hablar, se anotan en un papel al llegar.<br/>4) 20-40 mins Presentacion: Herramientas y buenas practicas de desarrollo en java - Ramiro Rinaudo<br/>5) 10 mins recreo<br/>6) 20-40 mins 2da Presentacion - Introduccion a BPM - Mauricio Salatino</p> ",
  "type" : "event"
}, {
  "created" : 1300414652000,
  "id" : "16963040",
  "name" : "Reunion Mensual - BPM",
  "status" : "past",
  "yes_rsvp_count" : 36,
  "venueName" : "Oficina de MuleSoft",
  "venueAddress" : "25 de Mayo 555 piso 9",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/16963040/",
  "description" : "<p>1) 30 mins Conocer a los demas.</p> <p>2) 10 mins Introduccion y agradecer ayuda de personas y sponsors.</p> <p>3) 20-30 mins. Presentaciones rapidas. Hablar y discutir sobre algunos temas que surgan de los miembros. Seria ideal si ya tiene idea o llevan algo armado. (Ya hay 3 charlas sobre Maven)</p> <p>4) 10 mins recreo</p> <p>5) 30-40 mins Presentacion: Introduccion a BPM - Mauricio Salatino<br/> </p> ",
  "type" : "event"
}, {
  "created" : 1304107082000,
  "id" : "17482930",
  "name" : "Como afecta la nube a la integracion de Applicaciones?",
  "status" : "past",
  "yes_rsvp_count" : 33,
  "venueName" : "Oficina de MuleSoft",
  "venueAddress" : "25 de Mayo 555 piso 9",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/17482930/",
  "description" : "<p>Dan Feist de MuleSoft nos va a dar la charla que dio en SOA+Cloud Symposium en Brasil la semana pasada.</p> <p> </p> <p>1) 18:30-19:00 Snacks y conocerse.</p> <p>2) 19:00 Arrancar, noticias JUG y Agradecer sponsors.</p> <p>3) 1hr Dan Feist (en español)</p> <p><b><i>What Does the Cloud Mean for Enterprise Integration?</i></b></p> <p>For the last two decades our demand for creating and using applications has only been surpassed by our need to integrate them. This evolution of integration during this time has provided a steam of standards, technologies, and buzzwords that software architects have attempted to digest while trying to \"do the right thing\".Recently with the generalized move to the cloud there is now a need to integrate with and between third-party cloud services. They say that the cloud changes everything and it does in a lot of ways. The proliferation of cloud service (SaaS) providers is revolutionizing how we build solutions through the pay-as-you-go usage model while the availability of infrastructure-as-a-service (IaaS) providers makes a huge difference to how applications are deployed, managed and scaled. However, integration continues to be a as, or more important than ever, as we build composite applications from and orchestrate between multiple SaaS providers. The cloud changes a lot of things, but it doesn't change integration. The cloud simply presents a new set of integration scenarios that enterprise integration will respond to as it continues to evolve. This presentation will briefly cover the some integration history including the current enterprise integration landscape to set the context before going on to explore what the cloud means for enterprise integration. First we'll look how the integration of cloud services differs from on-premise integration and in what ways it's actually exactly the same. After this we'll walk through the way in which the cloud has been, and continues to be, adopted looking at the impact that this has on enterprise integration. As I discuss some of the new integration scenarios that are appearing I will introduce some emerging Cloud Integration Patterns that response to these with examples. This presentation will conclude with some thoughts on the challenges that remain with cloud integration.</p> <p>4) Recreo</p> <p>5) Charlas Rápidas</p> <p>5.1) Control de Spam con Mahout por Emmanuel Espina</p> <p>5.2) Intro a Testing con Selenium por Nahuel Dalla Vecchia.</p> <p>6) Sorteos y despedida</p> <p> </p> ",
  "type" : "event"
}, {
  "created" : 1308238001000,
  "id" : "22433801",
  "name" : "Drools & jBPM5 Meetup @ Melia Hotel Buenos Aires",
  "status" : "past",
  "yes_rsvp_count" : 4,
  "venueName" : "Hotel Melia",
  "venueAddress" : "Reconquista 945 - Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/22433801/",
  "description" : "<p>Para todos los interesados en Administracion de Procesos de Negocio y Motores de Reglas maniana vamos a estar haciendo un evento con los lideres de los proyectos Drools y jBPM5 de JBoss. En el siguiente link pueden ver la agenda y los temas de las charlas. Si tienen preguntas no duden en mandar por aca o por privado.</p> <p><a href=\"http://salaboy.wordpress.com/2011/06/16/droolsjbpm5-event-buenos-aires-friday-june-17/\" class=\"linkified\">http://salaboy.wordpress.com/2011/06/16/droolsjbpm5-event-buenos-aires-friday-june-17/</a></p> <p> </p> <p>El evento va a ser en el Hotel Melia: <a href=\"http://www.melia-buenos-aires.com/es/melia-buenosaires.html\" class=\"linkified\">http://www.melia-buenos-aires.com/es/melia-buenosaires.html</a></p> <p>Las inscripciones estan manejadas por eventbrite aqui, porfavor anotense ahi:</p> <p><a href=\"http://droolsba.eventbrite.com/\" class=\"linkified\">http://droolsba.eventbrite.com/</a></p> <p>Espero verlos a todos ahi.</p> <p>Saludos</p> <p> </p> ",
  "type" : "event"
}, {
  "created" : 1306245560000,
  "id" : "19524971",
  "name" : "Search Engines",
  "status" : "past",
  "yes_rsvp_count" : 37,
  "venueName" : "Oficina de MuleSoft",
  "venueAddress" : "25 de Mayo 555 piso 9",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/19524971/",
  "description" : "<p>Para esta reunion de search engines vamos a tener 2 charlas muy interesantes!</p> <p>1) Tomas Fernandez Lobbe va a presentar</p> <p>Introducción a Search Engines  Introducción a Lucene Que es?  Conceptos Básicos  Solr Que es? Conceptos básicos y que agrega a Lucene Features Escalabilidad  </p> <p>2) Edgar Espina va a hablar sobre:</p> <p>Caso de uso Solr client con Ajax-Solr Sponsored Search with Solr Tika and Solr Integration Tambien acuerdense que pueden ver la presentacion online!. Para eso conectense a las 19:00 el jueves a <a href=\"http://mulesoft.adobeconnect.com/jugar\"><a href=\"http://mulesoft.adobeconnect.com/jugar\" class=\"linkified\">http://mulesoft.adobeconnect.com/jugar</a></a> y seleccionen Enter as a Guest, pongan su nombre e instalen Adobe connect si no lo tienen.</p> <p>Esperamos que mas y mas gente pueda aprovechar las charlas de esta forma!</p> <p>Nos Vemos!</p> <p>Ramiro</p> <p> </p> <p> </p> ",
  "type" : "event"
}, {
  "created" : 1309887960000,
  "id" : "24624071",
  "name" : "Escala el Everest con Scala",
  "status" : "past",
  "yes_rsvp_count" : 44,
  "venueName" : "Oficina de MuleSoft",
  "venueAddress" : "25 de Mayo 555 piso 9",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/24624071/",
  "description" : "<p>Gustavo Arjones va a presentar sobre Scala y Edgar Espina de una charla corta de porque otros lenguajes en la JVM.</p> <p> </p> <p>Anotense! y acuerdense que pueden verla online en: <a href=\"http://mulesoft.adobeconnect.com/jugar/\" class=\"linkified\">http://mulesoft.adobeconnect.com/jugar/</a></p> <p> </p> <p>Voy a poner mas datos de los temas pronto, pero ya vayan anotandose!</p> ",
  "type" : "event"
}, {
  "created" : 1306252599000,
  "id" : "19538971",
  "name" : "Java 7. Que hay de nuevo viejo?",
  "status" : "past",
  "yes_rsvp_count" : 45,
  "venueName" : "Zauber Software",
  "venueAddress" : "Costa Rica 5546",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/19538971/",
  "description" : "<p>Juan Codagnone y Mariano Cortesi de Zauber van a llevarnos por un paseo sobre los nuevos features de Java 7. </p> <p>Para ver online la presentación, conectense a las 19:00 a </p> <p><a href=\"http://mulesoft.adobeconnect.com/jugar\"> mulesoft.adobeconnect.com/ jugar</a></p> <p> </p> <p> </p> <p> </p> <p> </p> ",
  "type" : "event"
}, {
  "created" : 1306246027000,
  "id" : "19525611",
  "name" : "Play - Un framework no apto para puristas",
  "status" : "past",
  "yes_rsvp_count" : 75,
  "venueName" : "Globant",
  "venueAddress" : "Ingeniero Butty 240 9Â° floor, Buenos Aires",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/19525611/",
  "description" : "<p>Sebastian Scarano nos va a mostrar todas las ventajas y desventajas, y porque los puristas se arrancan los pelos cuando ven las cosas que Play hace para simplificar la vida de los desarrolladores.</p> <p>Los esperamos 18:30 y a las 19:00 arrancamos. Recuerden que es en el 9no Piso.</p> <p>Acuerdense que si no pueden venir en persona, pueden verlo online en: </p> <p><a href=\"http://mulesoft.adobeconnect.com/jugar\"><a href=\"http://mulesoft\" class=\"linkified\">http://mulesoft</a>. adobeconnect.com/jugar</a></p> <p>(No es necesario anotarse para verlo online, solo entren a las URL a las 19:00 hs).</p> <p> </p> <p>Los esperamos y no duden en contarle a sus amigos!</p> <p> </p> <p> </p> <p> </p> ",
  "type" : "event"
}, {
  "created" : 1318348810000,
  "id" : "36972642",
  "name" : "JUGAR 2011",
  "status" : "past",
  "yes_rsvp_count" : 114,
  "venueName" : "ITBA (Aula Magna)",
  "venueAddress" : "Av. Eduardo Madero 399",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/36972642/",
  "description" : "<p><a href=\"http://photos2.meetupstatic.com/photos/event/5/5/c/highres_69061372.jpeg\"><img src=\"http://photos2.meetupstatic.com/photos/event/5/5/c/event_69061372.jpeg\" /></a></p> <p>Hace click en la imagen para ver bien los horarios!</p> <p> </p> <p>Sobre las presentaciones!</p> <p><b>Dan Diephouse de MuleSoft</b> (Ingles)</p> <p>Nos va a contar la experiencia y los desafios que enfrentaron al crear el primer iPaaS del mercado. Caidas de EC2, escalar MongoDB, las ventajas y desventajas de ElasticSearch/Fume, muerte del OS. Como lograron crear un servicio escalable y redundante sin punto unico de fallas en tiempos tan cortos.</p> <p> </p> <p><b>Paulo Caroli de Thoughtworks </b>(Ingles)</p> <p>Paulo va a entrar en detalles sobre Kanban, y los limites que impone al Trabajo en progreso. Va a presentar una forma donde flexibiliza los limites de Kanban usando un metodo llamado objetivo-varianza. Donde el equipo controla  el trabajo en progreso usando el objetivo y varianza. (<a href=\"http://www.thoughtworks.com/events/join-revolution\"><a href=\"http://www.thoughtworks.com/events/join-rev\" class=\"linkified\">http://www.thoughtworks.com/events/join-rev</a>...</a>)</p> <p> </p> <p><b>Julio Faerman de Red Hat</b> (Ingles)</p> <p>JBoss es una comunidad open source muy activa desarrollando mas de 80 projectos. Algunos son muy conocidos como el application server y hibernate, pero otras pueden ser tan valiosos no tienen la misma publicidad. En esta charla Julio va a presentar todos los projectos activos de JBoss, como se usan en soluciones y como pueden mejorar la tuya.</p> <p> </p> <p><b>Jose Alvarez Muguerza de Turmeric - Turmeric SOA</b></p> <p>Jose nos va a presentar el proyecto Turmeric. Es una plataforma SOA para desarrollar, implementar, ejecutar y monitorear servicios y clientes. Esta escrito en Java y sigue los estándares SOAP, XML, JSON, XACML, etc.), y soporta WSDL (SOAP style - Doc Lit wrapped mode y REST style). Turmeric es la versión Open Source de la plataforma SOA usada por eBay para su negocio.   </p> <p> </p> <p><b>Matias Bagini de JRapid - Java en la nube</b></p> <p>En los últimos años surgieron nuevas plataformas para alojar aplicaciones Java en la nube. Google App Engine, Heroku, AWS Elastic Beanstalk, CloudBees, CumuLogic, CloudFoundry y OpenShift son algunas de estas nuevas propuestas. Durante esta sesión haremos una comparativa y mostraremos cómo publicar aplicaciones Java utilizando estas plataformas.</p> <p> </p> <p><b>Mariano Cortesi y Juan Codagnone de Zauber - Netty</b> Una introducción a a servidores no bloqueantes, sus usos, sus ventajas y como implementarlos usando jboss Netty</p> <p> </p> <p><b>Sebastian Scarano y Jorge Aliss - Introduccion a Play! Framework</b></p> <p>Desarrollaremos una aplicación paso a paso de manera interactiva, para mostrar las ventajas de este framework que trae la agilidad y facilidad de uso de frameworks como rails y django al mundo Java.</p> <p> </p> <p><b>Gustavo Brey de Red Hat - Web Frameworks</b></p> <p>El objetivo es una rápida introducción a frameworks web actuales y emergentes, para crear aplicaciones web y describir sus ventajas y desventajas. Este es un resultado de una investigación luego de haber desarrollado aplicaciones Web por más de 10 años en diferentes plataformas y lenguajes. <b><br/></b></p> <p> </p> <p><b>Sobre los presentadores:</b></p> <p><b>Dan Diephouse</b> (@dandiep) is an architect at MuleSoft, working to help build the next generation of middleware  and integration services which can address the challenges of the web and cloud computing.  He's co-founded Apache CXF, an open source web services framework; launched Tcat, an enterprise Tomcat application server; and helped shape Mule, the most popular open source ESB. Currently, he's been building Mule iON, a scalable integration PaaS which makes it extremely easy to do integration in the cloud.</p> <p><b>Paulo Caroli</b> (@paulocaroli)serves ThoughtWorks as an Agile Coach with over fifteen years of software development experience. He has a proven track record in variety of IT roles including: Developer, Application Architect, Project Manager, Business Analyst, Quality Assurance, Coach, and Trainer. In 2000 Paulo first encountered Extreme Programming, since then he has been ever-increasing his expertise in Agile Management and Agile Development processes and practices. Paulo has been authoring articles, conference sessions, and open source projects in a variety of IT subjects. </p> <p><b>Julio Faerman</b> (@jmfaerman) is a software engineer, developer and teacher, among other labels. Specialized in developing enterprise software with complex requirements and software process improvement, mostly for government and telecom. Currently works at Red Hat / JBoss, after Borland, NEC and independent<br/>clients of his own company. Is interested in a wide range of subjects, from algorithmic game theory to music and gardening, but always leaving time for community events and publications.</p> <p><b>Jose Alvarez Muguerza</b> (@jamuguerza) es consultor independiente SOA/J2EE y Technical Leader con amplia experiencia en actividades de management. Lleva más de 10 años desarrollando actividades al respecto y trabajando para empresas multinacionales como eBay, Intalio, Nimbuzz, Hewlett-Packard, Motorola, Vates, entre otras... Actualmente utiliza metodologías agiles, Scrum en particular. Jose es miembro Fundador de Turmeric, un proyecto Open Source bajo el dominio de eBayOpenSource. </p> <p><b>Matias Bagini</b> (@matiasbagini) es Ingeniero en Informática del ITBA. Fundador y CEO de JRapid, plataforma para desarrollo de aplicaciones Java cloud. Lleva más de 10 años trabajando con tecnologías web, especializandose en Java y Cloud Computing en los últimos años.</p> <p><b>Jorge Aliss</b> (@jaliss) es Licenciado en Informática de la UADE.  Actualmente trabaja en forma freelance haciendo desarrollo de software y consultoría con tecnologías Java, principalmente con Play framework. Anteriormente trabajó en Oracle, BEA y Fuego donde participó en el desarrollo de una herramienta de BPM, aplicaciones basadas en Java Server Faces y colaboró en proyectos para clientes en USA.</p> <p><b>Sebastián Scarano</b> (@develsas) es Ingeniero en Sistemas egresado de la UTN. Actualmente trabaja como líder de proyectos en el Ministerio de Trabajo de la Nación. Tiene años de experiencia desarrollando aplicaciones web complejas con lenguajes dinámicos. Actualmente es un activo participante de la comunidad Play y no pierde oportunidad de difundir sus bondades.</p> <p><b>Gustavo Andrés Brey</b> (@jbossalchemist) es Ingeniero y Arquitecto de IT que trabaja para Red Hat Argentina para las soluciones de Middleware, cuenta con más de 10 años en el desarrollo de aplicaciones y actualmente se encuentra involucrado en la comunidad open source de JBoss contribuyendo código. El Ing. Brey cuenta con experiencia de 5 años docente, ya que dicta una materia de Arquitectura de Proyectos de IT en la universidad UTN de Bs. As.</p> <p><b>Fernando Zunino (@fzunino):</b> Ingeniero en Informática del ITBA y  co-fundador de Zauber. Se desempeño hasta hace muy poco tiempo como CTO de Popego siendo responsable por la arquitectura de los distintos productos de la compañía. Cuenta también con 7 años de experiencia docente, dictando actualmente la materia Protocolos de Comunicación en el ITBA.</p> <p><b>Mariano Cortesi (@marianocortesi):</b> Ingeniero en Informática del ITBA y  co-fundador de Zauber. Experto en Java con amplia experiencia en diseño y arquitectura de sistemas. Fanático de aprender nuevas tecnologías y lenguajes con tinte funcional.</p> ",
  "type" : "event"
}, {
  "created" : 1322000571000,
  "id" : "42102122",
  "name" : "NLP and Machine-Learning",
  "status" : "past",
  "yes_rsvp_count" : 59,
  "venueName" : "Globant",
  "venueAddress" : "Ingeniero Butty 240 9Â° floor, Buenos Aires",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/42102122/",
  "description" : "<p>Dan Rozenfarb va a hablar sobre tecnología para moderar contenidos generados por el usuario en sitios Web2.0; pueden estar en varios formatos incluyendo texto, imágenes, video y audio. El objetivo es asegurarse que los contenidos cumplan con las reglas del sitio mediante métodos de moderación automática. Para poder comprender el contenido desarrollamos tecnologías de Procesamiento de Lenguaje Natural, de clasificación basada en reglas, Machine-Learning, y también Procesamiento de Imágenes. La presentación apunta a explicar qué problemas debemos resolver, que tecnologías usamos y contar algunas lecciones aprendidas a partir de nuestros tropiezos.</p> <p> </p> <p>Para verla online entra a <a href=\"http://mulesoft.adobeconnect.com/jugar/\"><a href=\"http://mulesoft.adobeconnect.com/jugar/\" class=\"linkified\">http://mulesoft.adobeconnect.com/jugar/</a></a><img src=\"http://img1.meetupstatic.com/img/clear.gif\" /></p> ",
  "type" : "event"
}, {
  "created" : 1321199780000,
  "id" : "40996422",
  "name" : "[JBUG] Introducción a jBPM5 (Drools Platform)",
  "status" : "past",
  "yes_rsvp_count" : 1,
  "venueName" : "Red Hat Argentina ",
  "venueAddress" : "Alicia Moreau de Justo 550 3er piso, Buenos Aires ",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/40996422/",
  "description" : "<p>La primer reunion del grupo de usuarios de JBoss en Argentina tendra lugar en las oficinas de Red Hat ubicadas en:  Alicia Moreau de Justo 550 3er piso. el dia 6 de Diciembre del 2011 a las 18:30 hs.</p> <p>El tema central de la reunion va a ser una introducción a jBPM5 y a la plataforma Drools, donde los primeros 30 minutos van a estar dedicados a introducir conceptualmente los temas y luego la idea es realizar algunos ejercicios para que los interesados se puedan llevar una experiencia practica sobre las herramientas. Los interesados en la parte practica van a necesitar tener una <b>laptop</b> con Java instalado y algún IDE con soporte para Maven.</p> <p>Para anotarse a estas reuniones enfocadas a workshops sobre tecnologias JBoss estamos usando otro meetup, ya que las sesiones van a ser mucho mas enfocadas y practicas. Usando su misma cuenta de meetup.com van a poder registrarse y reservar su asiento en la siguiente URL:</p> <p><a href=\"http://www.meetup.com/JBoss-User-Group-Argentina/events/40653242/\"><a href=\"http://www.meetup.com/JBoss-User-Group-Argentina/events/40653242/\" class=\"linkified\">http://www.meetup.com/JBoss-User-Group-Argentina/events/40653242/</a> </a></p> <p>Anotense porque hay cupos limitados (30 con waiting list)! </p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/4/3/b/e/event_72257342.jpeg\" /></p> <p> </p> <p> </p> <p> </p> <p><a href=\"http://s3.amazonaws.com/data.tumblr.com/tumblr_lug6fu932V1qfolieo1_1280.png\">(Version Grande)</a></p> <p>Segui todo el planeamiento de la primer juntada por twitter:<a href=\"http://www.twitter.com/JBUGArgentina\">@JBUGArgentina</a></p> <p>Esperamos sus comentarios y sugerencias para armar mas reuniones con workshops sobre tecnología donde podamos llevarnos una experiencia practica. </p> <p><b>No se olviden sus laptops!</b></p> ",
  "type" : "event"
}, {
  "created" : 1331840107000,
  "id" : "56499602",
  "name" : "Modern Web Applications",
  "status" : "past",
  "yes_rsvp_count" : 86,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/56499602/",
  "description" : "<p>La idea es realizar una charla teórica/práctica y demostrar como crear una applicacion web con las siguientes caracteristicas:</p> <p>* Sólida Arquitectura: que permite extender la aplicacion sin dolores de cabeza a futuro, simple de seguir, comprender y modificar, basada en REST &amp; Orientada a Servicios.<br/>* Aplicar y discutir tecnicas de diseño como domain driven design, module pattern, etc.</p> <p>* Demostrar acoplamiento y cohesion mediante el uso adecuado de modules.</p> <p>* Minimal application setup/configuration.</p> <p>* Application como producto y servicio.</p> <p>* Integración con clientes REST: backbone.js</p> <p>* Javascript/Css processors: para utilizar tecnologias como coffescript, lesscss, o minimizar codigo.</p> <p> </p> <p>Finalmente, el proposito de la charla es demostrar un end-to-end webapp utilizando tecnologias modernas.</p> <p>No se pierdan esta charla!!!</p> <p>Edgar</p> ",
  "type" : "event"
}, {
  "created" : 1334251740000,
  "id" : "60301992",
  "name" : "Clojure!",
  "status" : "past",
  "yes_rsvp_count" : 50,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/60301992/",
  "description" : "<p>Angel Lopez nos brindara una charla de introduccion a Clojure, como es, las ideas debajo de Lisp (Lisp en general, motivaciones), las nuevas de Clojure, conceptos de Shared Transactional Memory, etc.</p> <p>No es tanto sobre herramientas, sino sobre Clojure como lenguaje y tecnologias, las ideas que lo dirigen.</p> <p>Los esperamos!</p> <p> </p> ",
  "type" : "event"
}, {
  "created" : 1337380785000,
  "id" : "65393372",
  "name" : "WebSockets in Tomcat 7 - Clustering your application with Hazelcast",
  "status" : "past",
  "yes_rsvp_count" : 56,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/65393372/",
  "description" : "<p><b>Agenda</b></p> <p>19.00: WebSockets with Tomcat 7 by Filip Hanik</p> <p>20.00 Break</p> <p>20.15:  Clustering your application with Hazelcast by Faud Malikov</p> <p>Today's applications are getting more and more distributed everyday and it is well-known that distributed programming is hard. With &lt;a&gt;Hazelcast&lt;/a&gt; though, distributed programming is easy and lots of fun. Common reaction of Hazelcast users is 'Ooh my God, this cannot be that easy'. Hazelcast is an open source, highly scalable, transactional, distributed/partitioned implementation of queue, map, set, list, lock and executor service for Java. Hazelcast is for you if you like to easily:</p> <p>share data/state among many servers (e.g. web session sharing) cache your data (distributed cache) cluster your application partition your in-memory data send/receive messages among applications distribute workload onto many servers take advantage of parallel processing provide fail-safe data management <b>About the authors:</b></p> <p><b>Filip Hanik</b>, Senior Software Engineer</p> <p>Filip Hanik is a Senior Software Engineer for SpringSource and a key participant in the company's Apache Tomcat initiatives. Filip brings 15 years of extensive experience in architecture, design and development of distributed application frameworks and containers and is recognized for his top-quality system development skills and continuous participation of Open Source development projects.</p> <p>Filip is an Apache Software Foundation member and a committer to the Apache Tomcat project where he is a leading authority on Tomcat clustering and a key contributor to the core of the platform.<b><br/></b></p> <p><b>Fuad Malikov</b>, Hazelcast Co-Founder</p> <p>Prior to joining Hazelcast, Fuad worked on J2EE projects as a technology consultant in financial and telecom industries. He was an IT architect at IBM, developing J2EE based core-banking system for one of the biggest banking transformation projects in Europe. Prior to IBM, Fuad worked on various telecom companies developing J2EE and Oracle PL/SQL applications. He has attended several Mathematics Olympiad Competitions. He won three gold medals at national Maths Olympiads and a bronze medal at 42nd International Mathematical Olympiad (IMO), USA. Fuad holds a BS degree in Computer Engineering from Bogazici University, Istanbul.</p> <p> </p> <p>Online access: <a href=\"http://mulesoft.adobeconnect.com/jugar/\"><a href=\"http://mulesoft.adobeconnect.com/jugar/\" class=\"linkified\">http://mulesoft.adobeconnect.com/jugar/</a></a></p> ",
  "type" : "event"
}, {
  "created" : 1333052419000,
  "id" : "58424062",
  "name" : "Mule Developer Day",
  "status" : "past",
  "yes_rsvp_count" : 53,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/58424062/",
  "description" : "<p><img src=\"http://photos3.meetupstatic.com/photos/event/3/d/e/2/event_132975842.jpeg\" /></p> <p> </p> <p> </p> <p> </p> <p> </p> <p> </p> <p> </p> <p> </p> <p>Agenda</p> <p>18:00: Ya pueden llegar, tenemos algunas cosas para tomar y comer.</p> <p>18:30: Introducción a Mule ESB</p> <p>Dan Feist y Pablo Kraan del Core team del ESB van a dar una introducción a que es Mule ESB.</p> <p>19:30: Recreo</p> <p>19:45: Jorge D'Alessandro da una demo de como armar una aplicación usando Mule Studio. Seguido por una aplicación de ejemplo de Studio mostrando cosas  mas cercanas a un caso de uso real.</p> <p>20:30 Cierre y sorteos.</p> <p>Los esperamos!</p> <p> </p> <p>\n\n\n\n\n\n </p> ",
  "type" : "event"
}, {
  "created" : 1343493152000,
  "id" : "75288112",
  "name" : "Java en las nubes con OpenShift, tendencias de lo que se viene en Cloud y PaaS",
  "status" : "past",
  "yes_rsvp_count" : 61,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/75288112/",
  "description" : "<p>La propuesta es encontrarnos para compartir experiencias y perspectivas con respecto a las tendencias en cloud computing y lo que se viene en términos de Platform-as-a-Service (PaaS).</p> <p>La idea sería mostrarles lo que estamos haciendo a nivel global en Red Hat y en particular con el producto que actualmente lidero: <a href=\"https://openshift.redhat.com/\">OpenShift</a>, un servicio de plataforma abierta y elástica para programar y ejecutar aplicaciones en una nube sin tener que lidiar con la infraestructura o el software stack.</p> <p>Les propongo una charla mitad estratégica y mitad técnica con una agenda modelada por la audiencia. Como punto de partida, podríamos empezar con algo como esto:</p> <p>Introducciones Java se fue por las nubes PaaS y sus diferencias con Virtualización, IaaS y otras “...aaS” El verdadero valor agregado de PaaS para el programador Tendencias en el segmento PaaS PaaS desde la perspectiva de <a href=\"https://openshift.redhat.com/\">OpenShift</a>: Visión y Roadmap Proyecto <a href=\"https://openshift.redhat.com/community/open-source\">Origin</a>: OpenShift es Open Source! Demo 1: Subiendo un proyecto Java existente a OpenShift sin modificaciones! Demo 2: Codificando y corriendo el proyecto en la nube como si fuera en tu laptop Demo 3: Extendiendo Openshift: soporte para Play! Framework con el modelo “Do-it-Yourself” Preguntas y respuestas  </p> <p>Bio:</p> <p>Juan Noceda</p> <p>Gerente Global de Producto para OpenShift</p> <p>Red Hat, Inc. (USA)</p> <p>Con casi dos décadas de experiencia profesional en la industria del software a nivel internacional, Juan Noceda lidera la estrategia global y el roadmap de OpenShift en Red Hat.</p> <p>Durante su carrera profesional circuló por los roles de Programador, Emprendedor Startup, Arquitecto de Software, Diseñador de Producto y Gerente de Producto, y cuenta con títulos técnicos y universitarios en Informática y en Diseño de Producto.</p> <p> </p> <p>A lo largo de su carrera siempre balanceó su perfil técnico con el de negocio, focalizándose en productos de software empresarial y cloud con empresas como Microsoft, Pegasystems y Red Hat.</p> <p> </p> <p>Es un defensor y practicante de la mentalidad emprendedora y de las metodologías ágiles.</p> <p>Reparte su tiempo entre Boston y Silicon Valley, trabajando como uno de los protagonistas en el delineamiento del futuro de Cloud, Mobile y Big Data.</p> <p>Por estos días se dedica tiempo completo a su gran amor: OpenShift, con el que está redefiniendo el mercado de PaaS gracias a su estrategia Open-Hybrid-Cloud, que de manera única y bajo una misma filosofía de producto amalgama a los mundos de Open Source, Public Cloud y Private Enterprise PaaS.</p> <p> </p> <p>Contacto:</p> <p>Twitter: <a href=\"https://twitter.com/#%21/Juan_Noceda\">@Juan_Noceda</a></p> <p>Blog Personal-Profesional Sobre Negocios y Tecnologia: <a href=\"http://apaiox.blogspot.com/\"><a href=\"http://apaiox.blogspot.com/\" class=\"linkified\">http://apaiox.blogspot.com/</a></a></p> <p> </p> <p>Recursos Relacionados:</p> <p>Web:</p> <p><a href=\"http://openshift.redhat.com/\">OpenShift.RedHat.com</a></p> <p><a href=\"https://openshift.redhat.com/community/blogs/an-update-on-the-2012-openshift-roadmap\">OpenShift Roadmap</a></p> <p><a href=\"https://openshift.redhat.com/community/open-source\">Openshift Origin Page</a></p> <p>Entrevistas y Webinars Recientes:</p> <p><a href=\"http://www.google.com/url?q=http%3A%2F%2Fbitmason.blogspot.com%2F2012%2F03%2Fpodcast-juan-noceda-talks-nodejs_22.html&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNFQFLrZ8a7PL2yVPtVKSSupFjRYXA\">Entrevista en Inglés por Gordon Haff</a></p> <p><a href=\"http://www.javahispano.org/podcast/2012/5/30/javahispano-podcast-140-introduccion-a-cloud-computing-parte.html\">Entrevista en JavaHispano - Parte I</a> y <a href=\"http://www.javahispano.org/podcast/2012/6/6/javahispano-podcast-141-introduccion-a-cloud-computing-parte.html\">Parte II</a></p> <p><a href=\"http://www.redhat.com/about/events-webinars/webinars/2011-11-21-Build-and-Run-Java-in-the-Cloud-with-the-Dev-Tools-You-Love\">Webinar: Code-Build-Deploy on the Cloud with OpenShift and JBoss, Webinar with Mark Little, Max Anderson and Juan Noceda</a></p> <p>Presentaciones Recientes:</p> <p><a href=\"http://www.redhat.com.edgekey.net/summit/sessions/jboss.html#154\"><a href=\"http://www.redhat.com.edgekey.net/summit/sessions/jboss.html#154\" class=\"linkified\">http://www.redhat.com.edgekey.net/summit/sessions/jboss.html#154</a></a> <a href=\"http://www.redhat.com.edgekey.net/summit/sessions/jboss.html#809\"><a href=\"http://www.redhat.com.edgekey.net/summit/sessions/jboss.html#809\" class=\"linkified\">http://www.redhat.com.edgekey.net/summit/sessions/jboss.html#809</a></a></p> <p> </p> ",
  "type" : "event"
}, {
  "created" : 1346982241000,
  "id" : "81242802",
  "name" : "Mule ESB Laboratorio Practico",
  "status" : "past",
  "yes_rsvp_count" : 17,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/81242802/",
  "description" : "<p>Vamos a dar un laboratorio practico de Mule ESB. La idea es que puede venir gente que conoce o no Mule ESB y salir implementando soluciones reales. Este es un laboratorio que vamos a estar dando a usuarios en muchas ciudades del mundo, y queremos que la primera vez sea acá. Al ser un laboratorio practico tienen que venir con su notebook (ver mas abajo recomendaciones), ya que la idea es que puedan ustedes mismos crear las aplicaciones.</p> <p>No tiene costo alguno, y vamos como siempre, tener bebidas y algo para comer. El cupo es bastante limitado, por lo que si estan interesados, anótense rapido!.</p> <p>En esta ocasión no va a ser en el SUM, sino en nuestras oficinas en el Entre Piso.</p> <p>Los esperamos!</p> <p> </p> <p>Lo mejor, es que tengan Java 6 instalado y Mule Studio (<a href=\"http://www.mulesoft.com/mule-esb-enterprise-30-day-trial\" class=\"linkified\">http://www.mulesoft.com/mule-esb-enterprise-30-day-trial</a>). Eso va a acelerar las cosas.</p> ",
  "type" : "event"
}, {
  "created" : 1348931912000,
  "id" : "84667032",
  "name" : "Aplicaciones Concurrentes y Distribuidas con Akka, Java y Scala",
  "status" : "past",
  "yes_rsvp_count" : 75,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/84667032/",
  "description" : "<p><b>Aplicaciones Concurrentes y Distribuidas con Akka, Java y Scala</b></p> <p><br/>Akka (<a href=\"http://akka.io/\" class=\"linkified\">http://akka.io/</a>) es una herramienta que permite desarrollar aplicaciones concurrentes y distribuidas para la máquina virtual de Java sin la complejidad normalmente asociada a ese tipo de aplicaciones.</p> <p>Para lograrlo nos brinda un modelo de programación basado en actores en donde se elimina el estado compartido (y mutable) y se reemplaza por entidades independientes que se comunicanentre sí mediante mensajes.</p> <p>Akka es altamente concurrente (capaz de procesar más de 50 millones de mensajes por segundo en una sola máquina), tolerante a fallas, distribuido por diseño y es usadoen producción por empresas como Amazon, Vmware, Autodesk, Cisco, HP, Klout, etc. </p> <p><b>Presentado por el Ing. Fernando Rodríguez Olivera</b> (@frodriguez)<br/>Fernando Rodriguez es egresado de la carrera de Ingeniería de la Univ. de La Matanza y cuenta con más de 12 años de experiencia en el desarrollo de software.</p> <p>Comenzó su carrera en los laboratorios de Fuego, Inc. y luego trabajó en BEA Systems y Oracle principalmente en el diseño y desarrollo de software de base para un producto de BPM.</p> <p>Actualmente se desempeña como consultor independiente y profesor de las cátedras de Sistemas Distribuidos, Diseño de Compiladores y Lenguajes de Programación de la Universidad Austral.</p> <p> </p> <p> </p> ",
  "type" : "event"
}, {
  "created" : 1351630567000,
  "id" : "89226922",
  "name" : "2 en 1: Alertas y Monitoreo en la Nube y APIs REST",
  "status" : "past",
  "yes_rsvp_count" : 55,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/89226922/",
  "description" : "<p>Hola Chicos, En esta ocasión tenemos 2 charlas en una. La Primera es sobre Alertas y Monitoreo en la Nube Publica y la segunda sobre APIs REST y la arquitectura detrás de ellas. Ambas son en Ingles.</p> <p>Estos son los detalles de las charlas.</p> <p><b>1) Monitoring and Alerting in the Public Cloud</b></p> <p>The recent advent of inexpensive, ubiquitous cloud computing resources has drastically changed the landscape of monitoring and alerting. The old, datacenter-centric solutions have trouble scaling to accommodate the data load and realtime requirements of high availability distributed systems, and are often handicapped by design assumptions that limit their effectiveness in the public cloud. We'll discuss some common monitoring and alerting pitfalls, along with some solution patterns that have proven effective.</p> <p>Dave Thompson<br/>Bio:<br/>Dave is a systems engineer with a background in the architecture and implementation of large scale, highly-distributed, highly-available web applications. He's worn a variety of hats at a range of places, including Java webapp developer at Compuware, cloud engineer at Domino's Pizza, and recently site reliability engineer at Netflix. Dave's currently the devops engineer on the CloudHub project at MuleSoft.</p> <p><b>2) I Got 99 Problems, but REST Ain’t One</b></p> <p>The world’s most popular services expose ReST APIs. Whether it’s in Google, Twitter, Amazon, or even your middleware, ReST is everywhere. Have you ever wondered why APIs look the way they do? Is there a balance between API design for usability and scale, or can we have them both? What’s the relationship between standards such as WS-* and ReST? This session walks you through the relationship between the ReST API and architecture. It dissects popular APIs from companies such as Amazon and Twitter and uncovers designs that facilitate scale. Along the way, the presentation identifies aspects that can be cherry-picked, versus those that work best together. It also underscores trade-offs you should know about when putting together your API.</p> <p>Adrian Cole Bio:</p> <p>Adrian founded the open source project jclouds in March 2009, and is actively engaged in cloud interoperability and devops circles. Recent efforts include vCloud ecosystem engineering at VMware, Java integration at Opscode, and cloud portability efforts at Cloudsoft. Adrian's now an Architect of the CloudHub platform at MuleSoft.</p> <p> </p> <p> </p> ",
  "type" : "event"
}, {
  "created" : 1350817865000,
  "id" : "87894422",
  "name" : "Tutorial sobre Big Data",
  "status" : "past",
  "yes_rsvp_count" : 11,
  "venueName" : "Hotel Bel Air",
  "venueAddress" : "1462 Arenales",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/87894422/",
  "description" : "<p>Chicos, esta no es una charla del JUG, pero me pareció interesante difundirla. Tenemos un precio especial para los miembros del JUG, donde hay 20 lugares, y tienen tiempo hasta el viernes para anotarse y poder conseguirlo, sino van a tener que pagar el precio completo.</p> <p> </p> <p>Usar este link para acceder al descuento: <a href=\"http://bigdata-argentina.eventbrite.com/?access=USERGROUP\" class=\"linkified\">http://bigdata-argentina.eventbrite.com/?access=USERGROUP</a></p> <p>Datos sobre la charla:</p> <p>¿Por qué realizar esta capacitación?</p> <p>Esta capacitación está destinada a profesionales que necesiten saber acerca de Big Data – lo que significa y cómo trabajar con ella (haga clic <a href=\"http://bigdata-argentina.eventbrite.com/\">aquí</a> para registrarse y obtener más detalles del evento).</p> <p>Durante esta sesión de medio día se hablará sobre Big Data en general y las tecnologías específicas utilizadas para resolver problemas de Big Data, incluyendo:</p> <p>Map-reduce con <a href=\"http://hadoop.apache.org/\">Hadoop</a> Flujos de trabajo con <a href=\"http://www.cascading.org/\">Cascading</a> y <a href=\"http://hive.apache.org/\">Hive</a> Almacenamiento NoSQL con <a href=\"http://cassandra.apache.org/\">Cassandra</a> y <a href=\"http://hbase.apache.org/\">HBase</a> Procesamiento en tiempo real con <a href=\"http://www.infoq.com/news/2011/09/twitter-storm-real-time-hadoop\">Storm</a> Esta capacitación se basará en la amplia experiencia del instructor con Apple, Groupon, y muchos startups del área de la Bahía (San Francisco), para no sólo explicar lo que estas tecnologías hacen, sino cómo y cuándo tiene sentido usarlas.</p> <p>La presentación será en inglés, con guías impresas en español de todo el contenido.</p> <p>Biografía del instructor</p> <p><img src=\"http://scaleunlimited.com/downloads/headshot/kkrugler-BW-square-120.jpg\" /> <a href=\"http://www.linkedin.com/in/kenkrugler\">Ken Krugler</a> ha estado utilizando Hadoop desde su inicio hace seis años, y es un arquitecto promotor, y empresario activo en el campo de Big Data. Su compañía actual (<a href=\"http://www.scaleunlimited.com/\">Scale Unlimited</a>) ofrece capacitación y consultoría en Big Data, búsqueda y proyectos de aprendizaje automático para empresas grandes y pequeñas. Habla regularmente en las Cumbres de Hadoop, conferencias Strata y eventos de grupos de usuarios en los EE.UU. y en Europa.</p> <p>¿Quién puede asistir?</p> <p>Esta capacitación es apta para desarrolladores, administradores, arquitectos, o cualquier persona que quiera o necesite aprender más sobre el complejo y rápidamente cambiante mundo de soluciones Big Data. No es necesario el conocimiento previo de Hadoop, Cassandra u otras tecnologías de Big Data.</p> <p>Temario del Curso</p> <p>¿Qué es Big Data exactamente? Volumen, velocidad, variedad El Data exhaust ahora vale oro Cómo trabajar con Big Data Nuevas tecnologías al rescate Hadoop como base Ecosistema Hadoop Servidores con base en la nube Habilidades esenciales Big Data Gerenciales/Ejecutivas De desarrollo Map-reduce con <a href=\"http://hadoop.apache.org/\">Hadoop</a> Almacenamiento y ejecución a escala Hadoop Distributed File System (HDFS) Hadoop Map-reduce ¿Cuándo tiene sentido Hadoop? Flujos de trabajo con <a href=\"http://www.cascading.org/\">Cascading</a> y <a href=\"http://hive.apache.org/\">Hive</a> Abstracciones en alto nivel de procesamiento de datos El uso de Cascading para problemas complejos de ETL El uso de Hive para consultas ad hoc Almacenamiento NoSQL con <a href=\"http://cassandra.apache.org/\">Cassandra</a> y <a href=\"http://hbase.apache.org/\">HBase</a> La lógica detrás del movimiento NoSQL Modelar tu data en un mundo plano Cassandra en 10 minutos o menos HBase en pocas palabras <a href=\"http://lucene.apache.org/solr/\">Solr</a> como solución NoSQL Procesamiento en tiempo real con <a href=\"http://www.infoq.com/news/2011/09/twitter-storm-real-time-hadoop\">Storm</a> Qué hacer cuando el procesamiento por lotes no posible De qué manera Storm proporciona escalabilidad y fiabilidad Desafíos en la creación de flujos de trabajo basados en Storm  </p> ",
  "type" : "event"
}, {
  "created" : 1363382608000,
  "id" : "109456692",
  "name" : "Discusiones Abiertas de Arquitectura",
  "status" : "past",
  "yes_rsvp_count" : 33,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/109456692/",
  "description" : "<p>La idea de la próxima reunion es tener discusiones abiertas de arquitectura. Si alguno tiene algún proyecto complejo y puede discutirlo con los demás, puede traer algo y queda abierto a discusion!.</p> <p>Si alguien tiene alguna charla rapida, tambien podemos armar algo!.</p> <p>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1370531011000,
  "id" : "123258102",
  "name" : "What You Need to Know About Lambdas",
  "status" : "past",
  "yes_rsvp_count" : 69,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/123258102/",
  "description" : "<p><b>What You Need to Know About Lambdas</b></p> <p>Lambdas are coming to the Java language in the upcoming release of Java 8! While this is generally great news, many Java developers have never experienced lambdas before, and may not realize the costs and pitfalls associated with this style of programming. In this talk, we will discuss the many issues of using Lambdas in Java as well as Scala, Clojure and JRuby, as well as measures we can talk to avoid them. We will also review concepts associated with lambdas to make sure everyone is on the same page, such as closures, higher order functions and Eta Expansion.</p> <p> </p> <p><b>Bio</b></p> <p>Jamie Allen is the Director of Consulting for Typesafe, with almost 20 years of experience delivering enterprise solutions across myriad industries, platforms, environments and languages. He has been developing enterprise applications with Scala since 2009, primarily using Actors for fault tolerance and managing concurrency at scale.</p> ",
  "type" : "event"
}, {
  "created" : 1370024881000,
  "id" : "122234702",
  "name" : "DSLs y Template Engines: Introducción e implementación de Handlebars.java",
  "status" : "past",
  "yes_rsvp_count" : 51,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/122234702/",
  "description" : "<p>Handlebars.java es un template engine basado en Mustache, con features adicionales que lo hacen especial para el desarrollo web.</p> <p>Discutiremos el concepto \"logic less\" de Mustache y cuales son sus ventajas en relación a Freemarker/Velocity/JSP (por mencionar algunos).</p> <p><br/>Además, veremos como crear un simple DSL (domain specific language) con ANTLRv4.</p> <p><br/>Introducción:</p> <p>\n\nConstruyendo un domain specific language<br/>Que es BNF? Que es un AST (Abstract Syntax Tree)? Construir simple template engine con ANTLRv4 Introducción a Mustache: a logic less and contextual template engine Implementación de Mustache en JavaScript y Java La pila en Mustache</p> <p>Un moderno template engine:</p> <p>\n\nPor que Handlebars.java? Prototipado de web pages con Handlebars.java server Que es un helper? Uso de built-in y creación de helpers with Handlebars.java. Donde esta mi template? Resolver templates desde el file system, classpath, base de datos, etc. Data sources in Handlebars.java Integración web usando JavaScript tools &amp; techniques (handlebars.js, require.js, i18n.js, and more)  </p> ",
  "type" : "event"
}, {
  "created" : 1379704177000,
  "id" : "141334582",
  "name" : "APIs y el Futuro",
  "status" : "past",
  "yes_rsvp_count" : 60,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/141334582/",
  "description" : "<p>Ramiro Rinaudo y Federico Bongiovanni van a dar una charla sobre APIs y el futuro. </p> <p>Vamos a cubrir la historia de las APIs abiertas, las tendencias, la evolución, como cambiaron la forma en la que se hacen negocios en la web y algunos ejemplos de esto.</p> <p>También vamos a hablar de un tema que esta cambiando todo, \"La Internet de las cosas\" (Internet of the things) y como va a afectar el futuro y para que tenemos que estar preparados.</p> <p>No es una charla específica de Java, por lo que pueden invitar a sus amigos de otras tecnologías como .Net y JavaScript!.  </p> <p><br/>Como siempre vamos a tener algo para tomar y comer. La idea es arrancar a las 19:00 en punto la charla y dura un poco mas de una hora. </p> <p>Recuerden que pueden confirmar hasta las 14hs el mismo día, pero lo mejor es registrarse lo antes posible para poder ayudarnos a organizar mejor la comida, etc.</p> <p>Los Esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1401227428000,
  "id" : "185494502",
  "name" : "Java 8",
  "status" : "past",
  "yes_rsvp_count" : 83,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/185494502/",
  "description" : "<p>La primer reunion del Año, tenia que ser sobre la nueva version de la JVM. En esta ocasión Fernando Petrola va a mostrarnos los nuevos features del lenguaje pasando por:</p> <p>\n\n•  Lambda</p> <p>• Functional Interfaces</p> <p>• Stream API</p> <p>• Nashorn (si alcanza el tiempo)</p> <p>Los esperamos a todos!<br/>6:30PM pueden venir y la charla arranca a las 7PM.</p> <p><br/><b>Fernando Petrola</b><br/>Arquitecto y Lider tecnico en bvision. 28 años de experiencia en programación pasando por diferentes tipos de lenguajes: asm, c, c++, java, smalltalk, entre otros.<br/>13 años de experiencia en Java.<br/>Aportes a la comunidad open source en proyectos como SwingWT, Tellico, y desarrollo de los proyectos WebOnSwing, JDolly y lenguaje Humo.</p> ",
  "type" : "event"
}, {
  "created" : 1406323835000,
  "id" : "197071352",
  "name" : "Primer Hackathon Abierto!",
  "status" : "past",
  "yes_rsvp_count" : 24,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/197071352/",
  "description" : "<p>Vamos a estar organizando el primer hackathon abierto del grupo. La idea es juntarnos a las 11AM, arrancar al medio dia, y terminar a las 8pm. Ahi vienen las presentaciones, algunos premios y cerramos con algo para comer y tomar.</p> <p>Las reglas:</p> <p>• Se puede usar cualquier lenguaje, no solo Java o que corra en la JVM.  </p> <p>• Hay que contribuir a un proyecto Open Source. Puede ser cualquiera, no necesariamente famoso (ej: Mule ESB, Spring, Go, Vertx, etc). </p> <p><br/>• Dura 8 horas. </p> <p><br/>• Equipos de 1 hasta 5 integrantes</p> <p>• Se va a evaluar el impacto de la contribución. </p> <p>\n\n\nEstamos definiendo algunos premios para el equipo ganador y menciones. Apenas tengamos algo les avisamos. </p> <p>Prometemos comida, bebidas y diversion!, por lo que pedimos que se registren todos los participantes, así podemos calcular bien las cantidades.  </p> <p>Apuren a anotarse ya que vamos a tener cupo limitado!.  </p> ",
  "type" : "event"
}, {
  "created" : 1411062258000,
  "id" : "208068202",
  "name" : "JAVACONF",
  "status" : "past",
  "yes_rsvp_count" : 403,
  "venueName" : "UADE",
  "venueAddress" : "Lima 717",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/208068202/",
  "description" : "<p>Amigos y Colegas, </p> <p>Estamos organizando la JAVACONF, el evento de JAVA más importante para nuestra comunidad en Argentina. Vayan reservándose el día 14 de Noviembre, ya que estamos armando y consolidando charlas y speakers imperdibles. La JAVACONF propone una jornada que durará toda la tarde, por lo que vayan pidiendo permiso en sus trabajos o familias! </p> <p>\n\n\nSi quieren conocer mas datos pueden entrar en:</p> <p><a href=\"http://java.conf4.it/\"><a href=\"http://java.conf4.it\" class=\"linkified\">http://java.conf4.it</a></a></p> <p>Ya tenemos algunos speakers confirmados</p> <p><b>1) Gavin King</b></p> <p>Gavin King lidera el projecto Ceylon en Red Hat. Gavin es el creador de <a href=\"http://hibernate.org/\">Hibernate</a>, el popular mapeador de Objetos/Relacional de Java, y el creador de <a href=\"http://seamframework.org/\">Seam Framework</a>, un framework de aplicaciones Enterprise en Java. El contribuyo a la Java Community Process como el representante de JBoss and después de Red Hat para las especificaciones de EJB y JPA y como el lider de la <a href=\"http://jcp.org/en/jsr/detail?id=299\">CDI specification</a>.</p> <p>Gavin ahora trabaja a tiempo completo en  Ceylon, puliendo la especificación del lenguaje, desarrollando el frontend del compilador, trabajando con el IDE, y pensando sobre la SDK y el futuro de la plataforma. El sigue siendo un fan de Java, así como otros lenguajes como Smalltalk, Python y ML. </p> <p><b>2) Fernando Rodriguez Olivera</b></p> <p>Fernando Rodríguez es egresado de la carrera de Ingeniería de la Univ. de La Matanza y comenzó su carrera en los laboratorios de Fuego, Inc.,  luego trabajó en BEA Systems y Oracle principalmente en el diseño y desarrollo de software de base para un producto de BPM.</p> <p>Actualmente se desempeña como consultor independiente y profesor de las cátedras de Sistemas Distribuidos, Diseño de Compiladores y Lenguajes de Programación de la<br/>Universidad Austral.</p> <p>Fernando es el creador de mvnrepository.com uno de los sitios mas populares de la comunidad de Java, organizador del grupo \"Buenos Aires High Scalability\" y autor de los cursos nosqlessentials.com</p> <p>\n\n\n<b>3) Pablo Romanelli junto a Adrián Fernando Fiore</b><br/>Pablo Romanelli es Ingeniero en Sistemas y docente de Técnicas Avanzadas de Programación en UTN FRBA. Desarrollador Scala en Socialmetrix. Apasionado en el diseño de software.</p> <p>Adrián Fernando Fiore es Ingeniero en Sistemas y docente de Algoritmos y Estructura de Datos en UTN FRBA. Desarrollador Backend en Socialmetrix especializado en Big Data.</p> <p>\n\n\n\n\n\nSi quieren conocer mas datos pueden entrar en:</p> <p><a href=\"http://java.conf4.it\"><a href=\"http://java.conf4.it\" class=\"linkified\">http://java.conf4.it</a></a></p> <p>También si estan interesados en dar alguna charla, lean este documento, es el call for papers:</p> <p><a href=\"http://files.meetup.com/1780859/javaconf-callforpapers.pdf\"><a href=\"http://files.meetup.com/1780859/javaconf-callforpapers.pdf\" class=\"linkified\">http://files.meetup.com/1780859/javaconf-callforpapers.pdf</a></a></p> <p><br/>Pueden enviar su propuesta hasta el 31 de Octubre!</p> <p>Los esperamos!</p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/e/1/3/e/600_411117662.jpeg\" /></p> <p>\n\n\nAgenda: </p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/7/3/4/3/600_431489507.jpeg\" /></p> <p>\n\n\nSi hay algún cambio los mantenemos al tanto!</p> ",
  "type" : "event"
}, {
  "created" : 1416188754000,
  "id" : "218725876",
  "name" : "Workshop Ceylon con Gavin King",
  "status" : "past",
  "yes_rsvp_count" : 14,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/218725876/",
  "description" : "<p>Hola a todos, </p> <p>Tenemos el agrado de hostear un workshop de Ceylon con nada menos que Gavin King. Tiene cupos muy limitados, por lo que pedimos que se anoten, aquellos realmente interesados y que van a ir seguro. </p> <p>Requerimientos que tienen que tener instalados en sus maquinas antes de llegar (sino lo tienen instalado, demoran el comienzo o se van a perder parte del workshop), por lo que es importante. </p> <p>- Java 7 o 8<br/>- Eclipse 4.4 Luna o 4.3 Kepler<br/>- Ceylon IDE 1.1<br/>   <a href=\"http://ceylon-lang.org/documentation/1.1/ide/install/\"><a href=\"http://ceylon-lang.org/documentation/1.1/ide/install/\" class=\"linkified\">http://ceylon-lang.org/documentation/1.1/ide/install/</a></a></p> <p>\n\nFinalmente, checkout el walkthough de Ceylon de github:<br/>   <a href=\"http://ceylon-lang.org/documentation/1.1/walkthrough/\"><a href=\"http://ceylon-lang.org/documentation/1.1/walkthrough/\" class=\"linkified\">http://ceylon-lang.org/documentation/1.1/walkthrough/</a></a></p> <p><br/>Nos vemos!</p> ",
  "type" : "event"
}, {
  "created" : 1432241013000,
  "id" : "222696466",
  "name" : "Jooby: Simple y facil de usar web framework",
  "status" : "past",
  "yes_rsvp_count" : 36,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/222696466/",
  "description" : "<p>Introducción  <a href=\"http://jooby.org/\">Jooby</a> un web framework minimalista para Java 8 o superior.</p> <p>Features</p> <p>• Solido. Construido sobre tecnologías maduras.</p> <p>• Escalable. Promueve el uso de aplicaciones stateless.</p> <p>• Rapido, modular y flexible. </p> <p>• Simple, efectivo y facil de usar. Ideal para pequeñas aplicaciones y también complejas.</p> <p>• Integración con JS tools gruntjs/gulp/etc</p> <p>\n\n\npor</p> <p>Edgar Espina.</p> <p>Arquitecto de Software con más de 14 años desarrollando software sobre Java (principalmente) y JavaScript.</p> <p><br/>Autor de <a href=\"http://jooby.org\">Jooby</a>, <a href=\"https://github.com/jknack/handlebars.java\">Handlebars.java</a>, <a href=\"https://github.com/jknack/antlr4ide\">ANTLR IDE</a> entre otros: <a href=\"https://github.com/jknack\"><a href=\"https://github.com/jknack\" class=\"linkified\">https://github.com/jknack</a></a></p> ",
  "type" : "event"
}, {
  "created" : 1443795648000,
  "id" : "225778209",
  "name" : "Drools (KIE) Workshop",
  "status" : "past",
  "yes_rsvp_count" : 53,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/225778209/",
  "description" : "<p>Viene Mauricio Salatino (<a href=\"http://salaboy.com/)\"><a href=\"http://salaboy.com/\" class=\"linkified\">http://salaboy.com/</a>)</a> y va a dar un workshop sobre Drools ( KIE ). </p> <p>Hay solo 30 lugares, por lo que anotense rápido para reservar su lugar y en caso de no poder, dejen el lugar a alguien más.   </p> <p>\n\n\nEsta esa solo la propuesta inicial, puede que vaya cambiando dependiendo el feedback que reciba y el tiempo que tengamos disponible para los workshops.</p> <p>1) Introducción a Drools (Que es un motor de reglas, como funciona, etc)</p> <p>2) Como empezar con Drools 6</p> <p>3) Introducción al nuevo KIE Server, como integramos nuestras aplicaciones con Drools</p> <p>4) Panorama general sobre KIE Workbench</p> <p>5) Drools Roadmap (7.x and future)</p> <p>6) Drools + Microservices (Docker/Kubernetes/Openshift)</p> <p>7) Historias y Casos de Uso de la comunidad (me gustaría tener una sección donde los participantes cuenten sus experiencias y para que están usando y/o evaluando Drools)</p> <p>\n\n\nSi tienen comentarios sobre los temas o si quieren agregar algo por favor comuníquense conmigo. La idea es usar nuestras laptops para programar una aplicación que use Drools durante el workshop. </p> <p>Considero que es mucho más valioso que colaboremos, compartamos experiencias y trabajemos en conjunto a dar 3+ hs de presentaciones sobre los proyectos. Por lo cual mientras más interactivo lo hagamos mejor.</p> ",
  "type" : "event"
}, {
  "created" : 1449161146000,
  "id" : "227188081",
  "name" : "Primer DevDay de Argentina!",
  "status" : "past",
  "yes_rsvp_count" : 1,
  "venueName" : "Oficina Microsoft de Argentina S.A.",
  "venueAddress" : "Bouchard 710, 4to piso",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/227188081/",
  "description" : "<p>El sábado 12 de diciembre, de 09:15 a 18:30, las comunidades de Javascript, Java, PHP y .NET, los invitamos al primer encuentro multi-comunidad de Argentina! Esta vez nos presta la oficina Microsoft.</p> <p>\n\n\nVamos a participar en la charla y workshop sobre Java, presentando <a href=\"http://jooby.org\">Jooby a micro web framework</a></p> <p>\n\n\nRegistro: <a href=\"https://eventioz.com.ar/e/devday-ar\"><a href=\"https://eventioz.com.ar/e/devday-ar\" class=\"linkified\">https://eventioz.com.ar/e/devday-ar</a></a> (meetup no)</p> <p>Home site: <a href=\"http://www.devdayar.com/\"><a href=\"http://www.devdayar.com/\" class=\"linkified\">http://www.devdayar.com/</a></a></p> ",
  "type" : "event"
}, {
  "created" : 1461160043000,
  "id" : "230515387",
  "name" : "Java Reactive Programming",
  "status" : "past",
  "yes_rsvp_count" : 93,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/230515387/",
  "description" : "<p><b>Java Reactive Programming</b></p> <p>• Introducción</p> <p>• Breve reseña sobre async programming en Java: Threads, Executor, ExecutorServices</p> <p>• Patrón Observer? Publish-Subscribe?</p> <p>• Por que programar reactive? Toda aplicación debe ser reactive?</p> <p>• RxJava (Netflix library)</p> <p>• Reactive Streams / Java 9 Flow APIs</p> <p>• Reactive web apps</p> <p>• Ejemplos</p> <p>\n\n\n<b>Nota</b>: Cuando respondan el RSVP deben indicar DNI (requerido por personal de Seguridad)</p> <p>\n\n\nAuthor: Edgar Espina.</p> <p>Arquitecto de Software con más de 15 años desarrollando software sobre Java y JavaScript. </p> <p>Autor de <a href=\"http://jooby.org/\">Jooby</a>, <a href=\"https://github.com/jknack/handlebars.java\">Handlebars.java</a>, <a href=\"https://github.com/jknack/antlr4ide\">ANTLR IDE</a> entre otros: <a href=\"https://github.com/jknack\"><a href=\"https://github.com/jknack\" class=\"linkified\">https://github.com/jknack</a></a></p> ",
  "type" : "event"
}, {
  "created" : 1467318355000,
  "id" : "232286599",
  "name" : "Docker: Herramientas de deployment modernas",
  "status" : "past",
  "yes_rsvp_count" : 90,
  "venueName" : "MuleSoft",
  "venueAddress" : "Av Corrientes 316, Capital Federal",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/232286599/",
  "description" : "<p>• Presentacion</p> <p>• Introduccion a docker</p> <p>• COW filesystems</p> <p>• Cgroups</p> <p>• Namespaces</p> <p>• Enumeración de soporte en diferentes plataformas (docker-machine)</p> <p>• Anatomia de dockerfile</p> <p>• Como se computan los layers</p> <p>• Docker builds</p> <p>• Creacion de imagenes</p> <p>• Orquestacion basica: Docker compose</p> <p>• Introduccion a orquestacion avanzada</p> <p>• DCOS / Mesos</p> <p>• Kubernetes</p> <p>• Rancher</p> <p>• Demo DCOS con aplicacion java</p> <p>\n\n\nAutor: <b>Sebastian Otaegui</b></p> <p>Sebastian Otaegui es un desarrollador de infraestructura (infrastructure as code) con mas de 15 años trabajando en la industria como administrador de sistemas enfocado especialmente en soporte de aplicaciones.</p> ",
  "type" : "event"
}, {
  "created" : 1475613095000,
  "id" : "234625549",
  "name" : "Redescubriendo la programación funcional, un cambio de paradigma",
  "status" : "past",
  "yes_rsvp_count" : 44,
  "venueName" : "Baufest",
  "venueAddress" : "Franklin D. Roosevelt 1655",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/234625549/",
  "description" : "<p><b>Charla</b>:</p> <p>Revisaremos las arquitecturas reactivas como nuevo paradigma de desarrollo en respuesta a las demandas y necesidades de los sistemas actuales.</p> <p>Analizaremos las ventajas que brinda la programación funcional como estrategia para su implementación.</p> <p><br/><b><br/></b></p> <p><b>Autores:</b><b><br/></b></p> <p><b>Ezequiel Surijon, </b>estudiante eterno de Ingenieria en electronica y apasionado de las ciencias. Programador Java desde el año 2000, y desde hace 2 incursionando en el paradigma reactivo. Actualmente trabaja en Baufest donde se desempeña como lider tecnico.</p> <p><b>Ignacio Perez Laborda</b> es un programador java/scala de sembidding en Despegar desarollando microservicios reactivos para forecasting con machine learning.</p> ",
  "type" : "event"
}, {
  "created" : 1491403310000,
  "id" : "238982803",
  "name" : "Crystal - un lenguaje de programación para humanos y computadoras",
  "status" : "past",
  "yes_rsvp_count" : 33,
  "venueName" : "w3 Americas",
  "venueAddress" : "Carlos Calvo 615, San Telmo",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/238982803/",
  "description" : "<p>Comenzamos el año con una charla super interesante sobre <a href=\"https://crystal-lang.org/\"><a href=\"https://crystal-lang.org\" class=\"linkified\">https://crystal-lang.org</a></a> de la mano de uno de sus desarrolladores!!</p> <p>La entrada sigue siendo libre y casi gratuita. En esta oportunidad pedimos que aporten con un alimento no perecedero el cuál sera donado a <a href=\"http://fundacionsi.org.ar\">fundación si</a>.</p> <p>Finalmente agredecer también a <a href=\"http://w3americas.com\"><a href=\"http://w3americas.com\" class=\"linkified\">http://w3americas.com</a></a> por hostear este meetup.</p> <p>Que vuelvan las charlas! Nos vemos pronto!!</p> <p>\n\n\n<b>Charla</b>:</p> <p>Crystal es un lenguaje de programación nacido en <a href=\"https://manas.tech/\">Manas.Tech</a>, 100% argentina, pensado para hacer feliz tanto a los humanos que lo programan como a las computadoras que lo ejecutan. Tipado estático con mínimas declaraciones de tipos, mensajes de error entendibles, código compilado con performance casi nativa, y una sintaxis tan linda que da envidia a más de un poeta.</p> <p>¿Vos tampoco lo creés posible? Vení y fijate :)</p> <p>Manas Tech - <a href=\"https://manas.tech/\"><a href=\"https://manas.tech/\" class=\"linkified\">https://manas.tech/</a></a> Twitter: <a href=\"https://twitter.com/manastech\">@manastech</a></p> <p>Crystal Language - <a href=\"https://crystal-lang.org/\"><a href=\"https://crystal-lang.org/\" class=\"linkified\">https://crystal-lang.org/</a></a> Twitter: <a href=\"https://twitter.com/crystallanguage\">@crystallanguage</a></p> <p><b>Bio</b></p> <p>Matías García Isaía: </p> <p>Desarrollador y evangelizador de Crystal en <a href=\"https://manas.tech/\">Manas.Tech</a>. Estudiante y ayudante de cátedra en la UTN FRBA. Disfruto aprender y enseñar todo lo que puedo, y compartir experiencias y buenos ratos en el camino. Me expreso mejor en markdown que en español escrito ¯\\_(ツ)_/¯</p> <p>Twitter: <a href=\"https://twitter.com/mgarciaisaia\">@mgarciaisaia</a></p> <p>Github: <a href=\"https://github.com/matiasgarciaisaia\">@matiasgarciaisaia</a></p> ",
  "type" : "event"
}, {
  "created" : 1495480731000,
  "id" : "240189108",
  "name" : "Introducción a Kotlin",
  "status" : "past",
  "yes_rsvp_count" : 95,
  "venueName" : "Medallia",
  "venueAddress" : "Humboldt 1550, 3er piso oficina 313",
  "group" : "jugargentina",
  "link" : "https://www.meetup.com/jugargentina/events/240189108/",
  "description" : "<p><b>Charla 1: Profiling con Java Flight Recorder</b></p> <p><br/>Introducción a profiling usando Java Flight Recorder y Mission Control.<br/>Como hacer tus recordings de eventos y opciones disponibles para analizarlos.<br/>Demo y ejemplos de su uso en <a href=\"http://www.medallia.com.ar/\">Medallia</a>.</p> <p>Author: Nicolás Rusconi</p> <p>Author: David Kigel</p> <p>\n\n\n<b>Charla 2: Introducción a Kotlin</b></p> <p><a href=\"http://kotlinlang.org/\">Kotlin</a> es un lenguaje moderno y estaticamente tipado creado por Jetbrains. En esta charla vamos aprender/discutir sobre:</p> <p><br/>• Sintaxis</p> <p><br/>• Funciones, clases y objetos</p> <p><br/>• Inferencia de tipos</p> <p><br/>• Expressions vs Statements</p> <p><br/>• Null Safety</p> <p><br/>• Data clases</p> <p><br/>• Lambdas, Extension functions</p> <p><br/>• Type-Safe Builder (a.k.a DSL)</p> <p>• Multiplatforma (Java, Android, JavaScript, LLVM)</p> <p>Con ejemplos en Kotlin y su equivalente en Java utilizando <a href=\"https://github.com/vavr-io/vavr\">vavr.io</a> (mientras sea posible :)</p> <p>\n\n\n\nGracias a <a href=\"http://www.medallia.com.ar/\">Medallia</a> por recibirnos!!</p> <p>\n\n\nNos vemos pronto!</p> <p>\n\n\nAutor: Edgar Espina.</p> <p>Arquitecto de Software con más de 15 años desarrollando software sobre Java y JavaScript.</p> <p>Creador de <a href=\"http://jooby.org\">Jooby micro framework</a>, <a href=\"https://github.com/jknack/handlebars.java\">handlebars.java</a></p> <p>Twitter: <a href=\"https://twitter.com/edgarespina\">@edgarespina</a></p> <p>Github: <a href=\"https://github.com/jknack\">@jknack</a></p> ",
  "type" : "event"
}, {
  "created" : 1381784333000,
  "id" : "145566692",
  "name" : "Primer Meetup Mensual - Noviembre",
  "status" : "past",
  "yes_rsvp_count" : 38,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/145566692/",
  "description" : "<p>En esta primera meetup tendremos estas charlas:</p> <p>\n\n\n• Saludo inicial del grupo de meetup </p> <p><br/>• TDD con JavaScript</p> <p><br/>• Grunt, Bower y/o requirejs</p> <p>\n\n\n\nAdemas, tendremos algunas cosas para picar y tomar a cargo de la gente de SCV.</p> ",
  "type" : "event"
}, {
  "created" : 1384431972000,
  "id" : "150860952",
  "name" : "Meetup Mensual - Diciembre",
  "status" : "past",
  "yes_rsvp_count" : 31,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/150860952/",
  "description" : "<p>Hola a todos!</p> <p>Como prometimos, ya pusimos la fecha para la siguiente meetup en Diciembre.</p> <p>Les recordamos que el horario de inicio esta como 6:30, pero la idea es estar arrancando a las 19 cuando ya estemos todos. En esa media hora vamos a estar picando y tomando algo, y despues en el intervalo nuevamente. Si alguno llega justito a las 19 o un poco mas tarde, venga igual!</p> <p>Estas son las charlas que se van a dar:</p> <p>1) YUI y Mojito - Por Juan Ignacio Dopazo</p> <p>2) Object creation Patterns in Javascript - Por Leonardo Garcia Crespo</p> <p>Al comienzo de la meetup y en el intervalo entre charlas habra picada y para tomar como la vez pasada. Si logramos un buen horario con las charlas, tambien la idea es quedarnos charlando y haciendo networking.</p> ",
  "type" : "event"
}, {
  "created" : 1386618013000,
  "id" : "154778562",
  "name" : "Meetup Mensual - Enero",
  "status" : "past",
  "yes_rsvp_count" : 45,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/154778562/",
  "description" : "<p>Arrancamos el año con meetups! Este 8 de enero vamos a estar teniendo la tercera meetup del grupo y la primera del 2014!</p> <p>Como siempre, la modalidad es la misma, arrancamos 6:30, y los que vamos llegando tenemos algo para tomar y comer y charlar. A las 7 arrancamos con la primera charla, de duracion de 45min y despues un breve break de 5 minutos para ir al baño y preparar la próxima charla. Luego, otra charla de 45min, y finalmente nos quedamos comiendo, tomando y charlando un poco más.</p> <p>Estas son las charlas para la próxima meetup:</p> <p>• De la teoría a la práctica: Desarrollando juegos con HTML5 y JS en el mundo real, por Andrés Pagella</p> <p><br/>• Programación Funcional: por qué debería interesarte, por Juan Pablo Saraceno</p> <p>\n\n\n\nLos esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1391104663000,
  "id" : "163493182",
  "name" : "Meetup Mensual - Febrero",
  "status" : "past",
  "yes_rsvp_count" : 41,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/163493182/",
  "description" : "<p>Ya no más espera! Se viene la meetup de Febrero!</p> <p>Antes que nada les pedimos disculpas por la demora en anunciar la fecha de la próxima meetup. Dado este retraso, el próximo evento será a mediados del mes y no al principio como solemos hacerlo.</p> <p>Tenemos 2 novedades para esta meetup: </p> <p><br/>Primero, ya varios nos pidieron y nos pareció una buena idea, dar un espacio para Lightning Talks, que serían mini-charlas de 5 minutos donde el que quiera puede decir/mostrar/hacer lo que quiera. Vamos a estar usando la pizarra para anotarse el día de la meetup.</p> <p>Segundo, por si no se enteraron en Marzo tenemos la <a href=\"http://jsconf.uy/\">JSConf en Uruguay</a> y tenemos una entrada para sortear!!! La condición es que vengas a la meetup y vamos a estar sorteándola entre los presentes, en vivo!</p> <p>No olviden de seguirnos en Twitter (<a href=\"http://twitter.com/meetupjs_ar\">@meetupjs_ar</a>) y proponernos charlas o gente interesada en dar charlas que uds conozcan! </p> <p>Sin más que decir, las charlas de la próxima meetup:</p> <p>• Adventures in Async, por <a href=\"https://github.com/getify\">Kyle Simpson</a></p> <p><br/>• Introducción a Node, por <a href=\"https://github.com/ajlopez\">Angel Lopez</a></p> <p><br/>Querés/sabes quién más puede participar de las próximas meetups? Contanos!</p> ",
  "type" : "event"
}, {
  "created" : 1395149799000,
  "id" : "171926342",
  "name" : "Meetup Mensual - Abril",
  "status" : "past",
  "yes_rsvp_count" : 39,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/171926342/",
  "description" : "<p>Nos salteamos un mes pero eso nos ayuda a tomar impulso para organizar con todo la Meetup de Abril!</p> <p>Como los meses anteriores, los esperamos en las oficinas de SCV donde vamos a poder disfrutar de buena gente, buenas charlas, picada y cervezas.</p> <p><br/>No olviden de seguirnos en Twitter (<a href=\"http://twitter.com/meetupjs_ar\">@meetupjs_ar</a>) y proponernos charlas o gente interesada en dar charlas que uds conozcan! </p> <p>Las charlas confirmadas (hasta ahora) son:</p> <p>• Introducción a Meteor, por Pablo Chiappetti</p> <p>• Introducción a Angular, por Guillermo L. K. Snipe</p> <p>Recuerde que también tenemos espacio para 3 lightning talks, asi que si tienen algo pequeño que quieren decir y/o mostrar, recuerden escribirlo en el pizarron cuando lleguen :)</p> <p><br/>Querés/sabes quién más puede participar de las próximas meetups? Contanos!</p> ",
  "type" : "event"
}, {
  "created" : 1398872892000,
  "id" : "180256382",
  "name" : "Meetup Mensual - Mayo",
  "status" : "past",
  "yes_rsvp_count" : 34,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/180256382/",
  "description" : "<p>Mayo va a ser un mes largo por eso le metemos onda con una nueva meetup.</p> <p><br/>Como siempre, la modalidad es la misma, arrancamos 6:30, y los que vamos llegando tenemos algo para tomar y comer y charlar. A las 7 arranca la primer charla.</p> <p>Este mes tenemos 2 charlas muy buenas  sugeridas y dadas por miembros de la Meetup-js!</p> <p>• Fundamentos Javascript - Mariano Campo</p> <p>• ES6: your new friend - Alejandro Oviedo García</p> <p>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1402519496000,
  "id" : "188531012",
  "name" : "Meetup.js de Junio",
  "status" : "past",
  "yes_rsvp_count" : 33,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/188531012/",
  "description" : "<p>Tarde pero seguro, la meetup de Junio nos encuentra en medio del mundial, pero no por ello con menos ganas de aprender!</p> <p>\n\n\nEn esta ocasión tenemos las siguientes charlas:</p> <p>* \"Hardcore functional programming\" - Leonardo Garcia Crespo</p> <p>* \"Devorando Streams\" - Juan Pablo Saraceno</p> <p>\n\n\nYa saben que siempre hay cerveza y comida gratis para los que vengan, asi que aprovechen a reservar su lugar cuanto antes!!!</p> ",
  "type" : "event"
}, {
  "created" : 1403880190000,
  "id" : "191621332",
  "name" : "Meetup Mensual - Julio",
  "status" : "past",
  "yes_rsvp_count" : 36,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/191621332/",
  "description" : "<p>Luego de disfrutar el mundial (y esperemos que la copa), que mejor que disfrutar de una gran meetup!</p> <p>Como siempre, la modalidad es la misma, arrancamos 6:30, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 arranca la primer charla.</p> <p><br/>No se pierdan estas 2 grandes charlas:</p> <p><br/>• Intro a Ember.js - Julio Olivera</p> <p>• ES6 Part 2 - Alejandro Oviedo García</p> <p>Como en la última oportunidad vamos a transmitir el evento por HO para los que no puedan venir.</p> <p><br/>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1408648380000,
  "id" : "202355182",
  "name" : "Meetup Mensual - Septiembre",
  "status" : "past",
  "yes_rsvp_count" : 41,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/202355182/",
  "description" : "<p>Retomamos la sana costumbre de reunión y discusión tecnológica con colegas de la comunidad.</p> <p>Como siempre, la modalidad es la misma, arrancamos 6:30, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 arranca la primer charla. Charlas:</p> <p>Angel 'Java' Lopez - Introduccion a Express<br/>Juan Pablo Kutianski - Introducción a D3</p> <p>Como en la última oportunidad vamos a transmitir el evento por HO para los que no puedan venir.<br/>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1412788261000,
  "id" : "212223902",
  "name" : "Meetup Mensual - Octubre",
  "status" : "past",
  "yes_rsvp_count" : 40,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/212223902/",
  "description" : "<p>A un mes de cumplir 1 año de meetups, seguimos la tradición de compartir con la comunidad nuevas charlas y discusiones, más comida y bebida, claro.</p> <p>Misma modalidad de siempre, arrancamos 6:30 y tendremos 2 charlas, arrancando a las 7. Entre ellas podrán ofrecerse para dar Lightning Talks los que tengan ganas!</p> <p>Las charlas son:</p> <p>Inside Meteor - Con Pablo Chiappetti</p> <p>Introducción a React - Con Sergio Gianazza</p> <p>\n\n\nVamos a transmitir el evento por HO para los que no puedan asistir.</p> <p>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1414697468000,
  "id" : "216621872",
  "name" : "Meetup Mensual - Noviembre",
  "status" : "past",
  "yes_rsvp_count" : 40,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/216621872/",
  "description" : "<p>Hola a todos! Ya se cumple un año de nuestra primer meetup y vamos a festejar haciendo lo que mejor sabemos hacer.... Organizar una meetup!</p> <p>En esta oportunidad vamos a tener las siguientes charlas:</p> <p><b>Documentando APIs, por Ezequiel Gonzalez Rial</b></p> <p><i>Un proyecto con 3 equipos, una necesidad y el proceso para encontrar la mejor forma de documentar una API</i></p> <p><b>Internacionaliza tus aplicaciones web, por Juan Ignacio Dopazo</b></p> <p><br/><i>Tradicionalmente, nuestras aplicaciones web entregaban todo el contenido armado desde el servidor, donde existen muchas herramientas y librerías bien establecidas para la internacionalización. Sin embargo, con la aparición de las aplicaciones single-page, las interfaces de usuario están siendo renderizadas en el cliente usando JavaScript. En esta charla presentaremos FormatJS: un conjunto de librerías de JavaScript para internacionalización enfocadas en darle formato a números, fechas y cadenas de caracteres. Haremos un resumen de la API Intl de JavaScript y de algunas de las librerías que hemos desarrollado, así como una serie de integraciones con Handlebars, Dust y React. Finalmente, discutiremos como estas herramientas pueden ser útiles incluso cuando tu aplicación tiene contenido en un solo lenguaje.</i></p> <p><br/>Esta ultima charla va a ser un preview de la que va a estar dando Juani en la JSConf!</p> <p>Con respecto a la JSConf, gracias a la buena onda de los organizadores, vamos a estar sorteando 2 entradas! Una razón más para venir a festejar el año de meetups.</p> <p>El sorteo se va a hacer entre los que estén <b>anotados</b> y <b>presentes</b> en la meetup, y se va a hacer entre medio de las 2 charlas.</p> <p><i>DISCLAIMER: En el sorteo no participarán ni los organizadores de esta meetup ni empleados de SCV.</i></p> <p>Como siempre, será la misma modalidad: 18:30 arrancamos con cervezas y picada, a las 19 arranca la primer charla, y Lightning Talks entre las 2 charlas principales. Se pueden ofrecer para las Lightnings el mismo día.</p> <p>También como siempre, les pedimos que se anoten solo si pueden venir, y si se anotaron y no pueden asistir, desanótense apenas sepan. Seamos solidarios con los que están en Waiting List.</p> <p>Los esperamos a todos!</p> ",
  "type" : "event"
}, {
  "created" : 1418149408000,
  "id" : "219154604",
  "name" : "Meetup Mensual - Diciembre",
  "status" : "past",
  "yes_rsvp_count" : 39,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/219154604/",
  "description" : "<p>Ultimo Meetup del año!</p> <p>Esta vez tenemos 2 speakers de lujo, para despedir el año con todo!</p> <p><b>Guillermo Rauch (founder <a href=\"https://www.learnboost.com/\">Learnboost</a> &amp; <a href=\"https://cloudup.com/\">Cloudup</a>, acquired by <a href=\"http://automattic.com/\">Automattic</a>)</b>- <i>Charla a Confirmar</i></p> <p><b>Martin Gontovnikas</b> <b>(Developer Advocate @ <a href=\"https://auth0.com/\">Auth0</a>)</b>- <i>WebComponents &amp; Polymer: The future of the web, now.</i></p> <p>Nada más y nada menos que el creador de Socket IO y organizador principal de la JSConf Argentina, y el creador de Restangular y host de la JSConf Argentina.</p> <p>Ambos con muy buena onda se ofrecieron a venir a nuestras meetups a charlar un rato sobre lo que más saben y también compartir una picada y bebidas como siempre hacemos.</p> <p>La modalidad es la de siempre, 6:30 arrancamos con comida y bebida, 7:00 arranca la primer charla, 45 minutos, luego a las 8:00 la segunda charla.</p> <p>Recuerden que tenemos cupo para 45 personas maximo, por lo que si estan anotados y ya saben con anticipacion que no pueden venir, dense de baja asi le dejan lugar a los que estan en lista de espera!</p> <p>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1424109816000,
  "id" : "220560133",
  "name" : "Meetup Mensual - Febrero",
  "status" : "past",
  "yes_rsvp_count" : 35,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/220560133/",
  "description" : "<p>Primer meetup del 2015!</p> <p>\n\nEn esta ocasión tendremos las siguientes charlas:</p> <p><b>Dan Zajdband </b>- <i>¿Qué ES 6? Introduccion a EcmaScript 6 y 6to5</i></p> <p>\n\n\n<b>Juan Pablo Saraceno </b>- <i>Aventuras seriales en el Desktop. Experiencias dando los primeros pasos juntando node-webkit y periféricos.</i></p> <p>\n\nLa modalidad es la de siempre, 6:30 arrancamos con comida y bebida, 7:00 arranca la primer charla, 45 minutos, luego a las 8:00 la segunda charla.</p> <p>\n\n\nRecuerden que tenemos cupo para 45 personas máximo, por lo que si están anotados y ya saben con anticipación que no pueden venir, dense de baja así le dejan lugar a los que están en lista de espera!</p> <p>\n\nLos esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1427293847000,
  "id" : "221391205",
  "name" : "Meetup Mensual - Abril",
  "status" : "past",
  "yes_rsvp_count" : 50,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/221391205/",
  "description" : "<p>Retomamos la sana costumbre de reunión y discusión tecnológica con colegas de la comunidad.</p> <p>Como siempre, la modalidad es la misma, arrancamos 6:30, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 (puntual) arranca la primer charla. </p> <p>Charlas:</p> <p><br/><b>Nicolas Bevacqua - High Performance in the Critical Rendering Path</b><br/>This talk covers the past, present and future of web application performance when it comes to delivery optimization. I'll start by glancing over what you're already doing -- minifying your static assets, bundling them together, and using progressive enhancement techniques. Then I'll move on to what you should be doing -- optimizing TCP network delivery, inlining critical CSS, deferring font loading and CSS so that you don't block the rendering path, and of course deferring JavaScript. Afterwards we'll look at the future, and what HTTP 2.0 has in store for us, going full circle and letting us forego hacks of the past like bundling and minification. </p> <p>Tenemos la suerte de que Jared Hanson esté en Argentina en esa fecha, y se ofreció a venir a dar una charla sobre su experiencia en el open source con Passport.js:</p> <p><b>Jared Hanson - Design Decisions behind Passport.js</b><br/>Passport.js didn't become one of the most popular authentication frameworks for no reason. It was designed with composability, extensibility and ease of use in mind. In this talk, Jared will explain all the design decisions behind Passport.js success and how you can apply those same techniques to your own projects.</p> <p><br/><i>Jared is a software engineer at Auth0 who lives in Berkeley, CA. He enjoys doing open source and one of his biggest contributions to the node community is passport.js, currently being downloaded 300.000+ per month.</i></p> <p>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1431563732000,
  "id" : "222517537",
  "name" : "Meetup Mensual - Mayo",
  "status" : "past",
  "yes_rsvp_count" : 40,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/222517537/",
  "description" : "<p>Se terminó la espera! Ahora si, más javascript por favor! Cómo si esto no fuera suficiente, le sumamos buena bebida, comida y gente muy copada como todos los meses.</p> <p><br/>Como siempre, la modalidad es la misma, arrancamos 6:30, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 (puntual) arranca la primer charla. </p> <p>Charlas:</p> <p><b>Damian Mendez Romera - A maintainable Flux</b></p> <p>A la hora de crear aplicaciones con React usando la arquitectura Flux surgen algunos inconvenientes cuando debemos armar un entorno que permita desarrollar aplicaciones fáciles de mantener y que puedan escalar en cantidad de funcionalidades y programadores. En esta charla vamos a contar algunos puntos claves a la hora de empezar a trabajar con esta tecnología, veremos diferentes implementaciones de Flux y algunos detalles en React que facilitan la interacción con los diseñadores. Si estás empezando con React o si te interesa empezar a pensar en Flux esta charla es ideal para vos.</p> <p><b>Mariano Germán Villarreal Küber - TypeScript?</b></p> <p>La frontera que nos separa a nosotros los desarrolladores Back End de los desarrolladores Front End, cada día se esta haciendo mas estrecha. Y pensar en una aplicación, que no tenga lógica en el cliente ya casi es algo imposible. Si queremos mantenernos competentes ante el cambio, debemos no solo ser capaces de escribir aplicaciones de gran tamaño del lado cliente, si no que debemos ser capaces de poder reutilizar cada componente en nuestra organización. Y ahora la pregunta? Estamos capacitados, tanto desarrolladores Back como Front, para escribir aplicaciones de esta envergadura?Y una pregunta mas importante? Estamos capacitados, para mantener esas aplicaciones que Construimos? Que es TypeScript? Podríamos definirlo como un lenguaje de programación que compila a JavaScript y que nos da las herramientas necesarias para dejar de construir aplicaciones, y comenzar a Diseñar Aplicaciones.</p> <p>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1433423637000,
  "id" : "223012522",
  "name" : "Meetup Mensual - Junio",
  "status" : "past",
  "yes_rsvp_count" : 45,
  "venueName" : "Flowics",
  "venueAddress" : "Costa Rica 5546 Oficina 506",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/223012522/",
  "description" : "<p><img src=\"http://photos1.meetupstatic.com/photos/event/5/3/6/f/600_438261359.jpeg\" /></p> <p><b>Este mes nos vamos de viaje todos juntos!!</b></p> <p><br/>Los amigos de <a href=\"http://www.flowics.com/\">Flowics</a> nos brindan hospedaje, bebida y comida para nuestro viaje al conocimiento. Estamos muy contentos de poder organizar este evento en otro lugar para seguir conociendo a la comunidad.</p> <p>Como siempre, la modalidad es la misma, arrancamos 6:30, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 (puntual) arranca la primer charla. </p> <p><b>Ahora a las charlas!!</b></p> <p><br/><b>Gabriel Montes - Probando en el browser</b></p> <p><br/>Breve introducción al testing y demostración práctica de como automatizar pruebas en el browser utilizando Mocha, Chai y Blanket.JS.</p> <p><b>Leonardo Garcia Crespo - Love coding with React</b></p> <p><br/>Creando una mini app desde cero con React, webpack y hot code reload.</p> <p><br/><img src=\"http://photos2.meetupstatic.com/photos/event/5/a/9/5/600_438803189.jpeg\" /></p> <p>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1437667913000,
  "id" : "224121472",
  "name" : "Meetup Mensual - Julio",
  "status" : "past",
  "yes_rsvp_count" : 50,
  "venueName" : "Mercadolibre",
  "venueAddress" : "Alem 518 piso 11",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/224121472/",
  "description" : "<p><b>Gran oferta! Compre, compre! Compre aprender más Javascript!</b></p> <p><br/><img src=\"http://photos1.meetupstatic.com/photos/event/b/4/f/8/600_440086328.jpeg\" /></p> <p>Este mes los amigos de <b><a href=\"https://www.google.com.ar/maps/place/Av.+Leandro+N.+Alem+518,+C1001AAN+CABA/@-34.6016604,-58.370536,17z/data=!3m1!4b1!4m2!3m1!1s0x95a3353320a243ef:0x7f0477032b574350?hl=es\">Mercadolibre</a></b> nos brindan hospedaje, bebida y comida. Qué mejor oferta que seguir aprendiendo! y conociendo a nuestra querida comunidad.</p> <p><b>Para ingresar necesitamos los siguientes datos antes de las 16 horas del día del evento:</b></p> <p><b>Número de DNI -&gt; Se va a pedir el día del evento</b></p> <p><b>Nombre y Apellido completo</b></p> <p>Podes completar los datos<a href=\"http://bit.ly/1VBO1Wa\">aquí</a></p> <p><br/>Como siempre, la modalidad es la misma, arrancamos 6:30, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 (puntual) arranca la primer charla.</p> <p><b>Ahora a las charlas!!</b></p> <p><br/><b>Intro Generators en ES6 - Diego Calderón</b></p> <p><br/>En esta presentación veremos uno de los conceptos más innovadores de ES6, generators. Repasaremos su sintaxis, casos de uso, y conceptos relacionados.</p> <p><b>JSCONF2015 - Guille Snipe</b></p> <p><br/>Guille estuvo en la JSCONF2015, y nos estará contando sobre las novedades y charlas que tuvieron lugar en la misma. Como frutilla del postre veremos una demo de nodecopters.</p> <p>Los esperamos</p> ",
  "type" : "event"
}, {
  "created" : 1439994233000,
  "id" : "224739782",
  "name" : "Meetup Mensual - Agosto",
  "status" : "past",
  "yes_rsvp_count" : 43,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/224739782/",
  "description" : "<p><img src=\"http://photos2.meetupstatic.com/photos/event/4/d/e/3/600_441079939.jpeg\" /></p> <p><b><br/></b></p> <p><b>Noticia de último momento!!!</b></p> <p><b>Vuelve la tarta de ricota con dulce de leche!!, volvemos a juntarnos en SCV.</b></p> <p>Como siempre, la modalidad es la misma, arrancamos 6:30, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 (puntual) arranca la primer charla. </p> <p>Luego de lavarte las manos por el dulce y el azúcar impalpable ahora si...</p> <p><br/><b>Las charlas: </b></p> <p><br/><b>Desarrollo De Aplicaciones Híbridas Con Apache Cordova - Joel De La Torriente </b></p> <p>Desarrollo de aplicaciones para moviles desde la perspectiva de un front-end developer. Un momento para conocer los beneficios y desventajas de las diferentes implementaciones de Apache Cordova y saber cual se ajusta mas al proyecto que queramos emprender.</p> <p><b>Creando una start-up, mirada tecnológica - Juan Manuel Cuello</b></p> <p><br/>Experiencia en la creación de una start-up desde el punto de vista tecnológico. El camino desde una aplicación web tradicional hasta a una Single Page App. Manejo de infrastructura, sincronismo entre dispositivos vía WebSockets, Offlline, HTML5 y ES6 entre otras cosas.</p> <p>Recuerden que tenemos cupo para 45 personas máximo, por lo que si están anotados y saben con anticipación que no pueden venir, dense de baja así le dejan lugar a los que están en lista de espera!</p> <p><br/>Los esperamos</p> ",
  "type" : "event"
}, {
  "created" : 1442436336000,
  "id" : "225403582",
  "name" : "Meetup Mensual - Septiembre o Setiembre!",
  "status" : "past",
  "yes_rsvp_count" : 38,
  "venueName" : "Flowics",
  "venueAddress" : "Costa Rica 5546 Oficina 506",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/225403582/",
  "description" : "<p><img src=\"http://photos4.meetupstatic.com/photos/event/7/8/7/6/600_442050838.jpeg\" /></p> <p>En Septiembre fue el día del programador, FELIZ DIA!! para todos los miembros de  nuestra querida comunidad!!</p> <p><br/>Este mes los amigos de <a href=\"http://www.flowics.com/\">Flowics</a> nos abren de nuevo las puertas de su casa y nos invitan las bebidas y la comida. Muchas Gracias!!!</p> <p><br/><b>Ahora a las charlas:</b></p> <p><b><i>Going back to the roots of MVC (Volviendo a las bases de MVC)</i><i> - </i>Juan Carlos Ivancevich </b><i><br/></i></p> <p>Vamos a explorar cómo estructurar nuestras aplicaciones utilizando Cerebral, una librería que tiene como objetivo poner a los controllers en su lugar dentro de MVC.</p> <p><br/><b>Getting over Moore's Law: Parallelization using JavaScript in the browser - Damian Schenkelman<br/></b><br/>Modern computers and devices continue the trend of having a larger number of CPU cores instead of cores with more computing power. That means that the days of waiting for Moore's Law to take effect so our apps run faster are over, and we, developers, need to start adventuring into the land of parallelism.</p> <p>In this talk we will go over some of the currently available approaches (and ongoing efforts) that make it possible to take advantage of parallelism in the browser using JavaScript. This includes not only the widely spread concept of Web Workers, but also Single Instruction Multiple Data (SIMD) and the downfall of ParallelJS and rise of SharedArrayBuffers.</p> <p><br/>Como siempre, la modalidad es la misma, arrancamos 6:30, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 (puntual) arranca la primer charla. </p> <p><b>La reserva se abre el Jueves 24 a las 17:00hs. </b></p> <p><br/>Los esperamos!!</p> ",
  "type" : "event"
}, {
  "created" : 1445433083000,
  "id" : "226208016",
  "name" : "Meetup Mensual - Octubre",
  "status" : "past",
  "yes_rsvp_count" : 36,
  "venueName" : "Acamica",
  "venueAddress" : "Darwin 1154, Torre Castillo, 2do G.",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/226208016/",
  "description" : "<p><img src=\"http://photos4.meetupstatic.com/photos/event/b/1/7/6/600_443325430.jpeg\" /></p> <p><b>En Octubre nos recibimos todos!!</b></p> <p>En esta oportunidad nos abren las puertas los amigos de <a href=\"https://www.acamica.com/\">Acamica</a> y nos invitan las bebidas y la comida. Muchas Gracias!!!</p> <p><br/>Como siempre, la modalidad es la misma, arrancamos 6:30, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 (puntual) arranca la primer charla.</p> <p><br/><b>La reserva se abre el Miércoles 28 a las 17:00hs. </b></p> <p><br/><b>Relajate y vamos a viajar en el tiempo:<br/></b></p> <p><b>CouchDB 101: Time to relax - Diego Peralta</b></p> <p>Apache CouchDB pertenece a la nueva generación de bases de datos NoSQL y esta específicamente diseñado para satisfacer las necesidades que tienen hoy las aplicaciones web. En esta charla les voy a contar cuales son las bondades que Couch nos ofrece a la hora de desarrollar una app que funcione de manera offline a través de un API rest.</p> <p><b>A fifth of century - Alejandro Oviedo García</b></p> <p>JavaScript cumplió 20 años el último mes de Mayo y muchas veces me encuentro hablando con colegas acerca del futuro del lenguaje, el cual parece prometedor desde mi punto de vista. Me dí cuenta que nunca hablamos acerca de los comienzos y del camino que se transitó hasta llegar a la realidad de hoy, cómo si fuera un tema tabú. En esta charla vamos a hacer un pequeño viaje desde el día de la fecha hasta los inicios del lenguaje, analizando las características importantes que se pierden durante el camino.</p> <p>Los esperamos!!</p> ",
  "type" : "event"
}, {
  "created" : 1447862266000,
  "id" : "226860253",
  "name" : "Meetup Mensual - Noviembre",
  "status" : "past",
  "yes_rsvp_count" : 5,
  "venueName" : "Oficina Microsoft de Argentina S.A.",
  "venueAddress" : "Bouchard 710, 4to piso",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/226860253/",
  "description" : "<p><img src=\"http://photos3.meetupstatic.com/photos/event/c/b/600_444300203.jpeg\" /></p> <p><b>Importante: Dado que es un evento en común con otras comunidades NO HAY RSVP y solo se pueden registrar por medio del siguiente <a href=\"https://eventioz.com.ar/e/thorsten-lorenz-en-argentina-banodejs-meetupjs-bee\">REGISTRACIÓN A EN EVENTIOZ</a>&lt;a&gt;.  &lt;/a&gt;Para poder ingresar al evento se les va a solicitar que presenten el documento que ingresaron en el formulario de registro.</b></p> <p><br/><b>Noviembre viene con 3x1!!</b></p> <p><br/>Este mes festejamos la llegada de Thorsten Lorenz a la Argentina y el segundo aniversario de <a href=\"http://www.meetup.com/meetup-js\">Meetup.js</a> junto a los amigos de <a href=\"http://www.meetup.com/banodejs/\">BAnodejs</a> y<a href=\"http://www.meetup.com/Beer-js-Buenos-Aires/\">Beer.js</a> en un evento que promete ser una fiesta.</p> <p><br/>En esta oportunidad nos alojan los amigos de <a href=\"http://www.microsoft.com/es-ar\">Microsoft</a>, nos invita la comida y bebida <a href=\"http://www.scvsoft.com/\">SCV</a> y la cerveza <a href=\"http://iamat.com/\">I AM AT</a>. Le damos las gracias a nuestros sponsors por acompañarnos.</p> <p>Como siempre, la modalidad es la misma, arrancamos 18:45, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 19:15 (puntual) arranca la primer charla.</p> <p><b>Este mes tenemos 2 charlas de lujo:</b></p> <p><b>The dirty secrets of building large, highly available, scalable HTTP APIs - Damian Schenkelman - <a href=\"https://twitter.com/dschenkelman\">@dschenkelman (Yenkel)</a></b></p> <p>Most HTTP APIs sites show how to implement the GET /hello sample and provide a list of links that developers can use to get more information about different topics.</p> <p>While those are definitely useful, large APIs that are to be consumed by other developers span a range of cross-cutting concerns that is hard to be aware of when you start to build them. In this talk we will go over some of these concerns, such as authentication, authorization, documentation, validation, rate limiting, geo-redundancy, and no downtime deployments, and will provide specific examples based on what we do at Auth0.</p> <p><b>Less pain, more gain: {NODE,IO}.JS tracing and debugging - Thorsten Lorenz - <a href=\"https://twitter.com/@thlorenz\">@thlorenz</a></b></p> <p>Driven by the <a href=\"https://github.com/iojs/tracing-wg\">tracing working group</a>, io.js is adding features</p> <p>to make it easier to trace code execution.</p> <p>The latest v8, which is part of io.js added numerous hooks that enable us to bridge the gap between C/C++ and JavaScript</p> <p>code in order to debug and inspect it across those layers.</p> <p>Even until we can fully leverage all these new features numerous modules on npm make some of this available to us today.</p> <p>In this talk I will show practical examples of both what is possible today and what’s coming in the near future.</p> <p><b>Al finalizar las charlas tenemos un sorteo sorpresa para los presentes</b></p> <p><b>Beer.js</b></p> <p>21:30hs - The Kilkenny Irish Pub &amp; Restaurant - <a href=\"https://www.google.com.ar/maps/place/Marcelo+T.+de+Alvear+399,+C1058AAA+CABA/@-34.5960679,-58.3752161,17z/data=!3m1!4b1!4m2!3m1!1s0x95bccacabe36206f:0x2b04d65e35e06848?hl=es\">Marcelo T de Alvear 399</a></p> <p>Tras el evento en Microsft nos mudamos a <a href=\"https://www.facebook.com/thekilkennyba/?rf=139273659479692\">The Kilkenny Irish Pub &amp; Restaurant</a> para tomar unas cervezas en un espacio más distendido.No es requisito haber participado del evento previo por lo cual quedan todos invitados a sumarse a esta parte del evento.</p> <p><b>Les pedimos disculpas, por anticipado, por comunicar este evento con tan poca anticipación. Esperamos que puedan venir.</b></p> <p><br/>Los esperamos!</p> <p>Los organizadores de <a href=\"http://www.meetup.com/meetup-js\">Meetup.js</a>, <a href=\"http://www.meetup.com/banodejs/\">BAnodejs</a> y <a href=\"http://www.meetup.com/Beer-js-Buenos-Aires/\">Beer.js</a></p> ",
  "type" : "event"
}, {
  "created" : 1450374087000,
  "id" : "227480111",
  "name" : "Meetup Mensual - Diciembre",
  "status" : "past",
  "yes_rsvp_count" : 47,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/227480111/",
  "description" : "<p><b>Festejemos que se termina el año!!!</b></p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/a/0/3/0/600_445181008.jpeg\" /></p> <p>En esta oportunidad arrancamos un poquito más tarde (19:00hs). Para los que van llegando tenemos algo para tomar, comer y charlar. A las 19:15hs (puntual) arranca la primer charla. Finalizamos el evento comiendo algunas cositas a la parrilla (avisen si alguno de los que viene es vegetariano) para despedir el año todos juntos.</p> <p>Ahora si, las charlas:</p> <p><br/><b>El zen de Angular - Hernan Rajchert</b></p> <p>En esta charla se analiza lo que Angular define como su zen y se ven las diferencias entre un estilo imperativo y uno declarativo no solo en el desarrollo web. Por último, se muestra como aplicamos estos conceptos para construirel video player de Acamica<b><br/></b></p> <p><b>Camina imperativo, vola funcional - Federico Pereiro</b></p> <p>En esta charla intentare mostrar como una combinacion de la programacion imperativa con la funcional permite crear programas sucintos, expresivos y faciles de comprender. La clave para esto es conectar ambas capas de forma adecuada y transparente. Este enfoque contrasta con el enfoque declarativo, que parte de ocultar la capa imperativa al usuario.<b><br/></b></p> <p>Los esperamos!!</p> ",
  "type" : "event"
}, {
  "created" : 1455898049000,
  "id" : "228975007",
  "name" : "Meetup Mensual - Febrero",
  "status" : "past",
  "yes_rsvp_count" : 25,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/228975007/",
  "description" : "<p><img src=\"http://photos3.meetupstatic.com/photos/event/d/6/d/600_447003437.jpeg\" /></p> <p><b>¡Volvemos en forma de workshop! </b></p> <p><br/>En esta oportunidad nos abren las puertas los amigos de <a href=\"http://www.scvsoft.com/\">SCV</a> y nos invitan las bebidas y la comida. Muchas Gracias!!!</p> <p><br/>Este martes, de 19 a 22hs, te esperamos para contarte sobre lo último de MeteorJS y que formes parte de un workshop.</p> <p><br/>Como siempre, la modalidad es la misma, arrancamos 18:45hs, y para los que van llegando tenemos algo para tomar, comer y charlar. A las 19hs (puntual) arranca el workshop. <b><br/></b></p> <p><b>Workshop</b> Meteor.js - Pablo Chiappetti </p> <p><br/>Meteor ya no es lo que era (para bien!). Con integración oficial con Angular y React, ES2015 y babel por defecto, y una integración con npm a la vuelta de la esquina, Meteor se abre cada vez más al ecosistema de Javascript y a su comunidad. En este workshop vamos a ir viendo las integraciones con cada uno de los frameworks y armaremos juntos una aplicación para mostrar el potencial que Meteor tiene hoy en día.</p> <p>Requisitos para el workshop: Tener <a href=\"https://www.meteor.com/install\"><b>Meteor</b></a> instalado.</p> <p><br/><b>Importante: Traer notebook para poder trabajar.</b></p> <p><br/>Los esperamos!!</p> ",
  "type" : "event"
}, {
  "created" : 1458828642000,
  "id" : "229839932",
  "name" : "Meetup Mensual - Marzo",
  "status" : "past",
  "yes_rsvp_count" : 55,
  "venueName" : "Wayra",
  "venueAddress" : "Costa Rica 5546 piso 6",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/229839932/",
  "description" : "<p><b>ATENCION: EL RSVP de esta meetup se abre el Lunes 28 a las 10AM!</b></p> <p>Llega el otoño y con el una nueva reunión de los Javascripters con mas onda de todo Buenos Aires!</p> <p><br/>Esta es una Meetup de lujo, Wayra nos va a estar abriendo las puertas de su casa para que estemos todos cómodos y Toptal va a estar sponsoreando las bebidas y comidas para que no pasemos hambre ni sed.</p> <p>Y como el techo y la comida no lo es todo, tenemos tres charlas <b>de lujo</b>:</p> <p>•  Angel \"Java\" Lopez y su charla \"Usando Machine Learning en Javascript\"</p> <p><br/>•  Dror Liebenthal con su charla (en inglés) \"How Freelancing and Remote Work are Changing the World\"</p> <p>•  Rodrigo Uroz con \"Escuchar y actuar\"</p> <p>\n\nComo en todas las meetups les pedimos que hagan RSVP si están seguros que pueden asistir, y si hicieron RSVP y no pueden asistir, les pedimos que dejen el lugar para la gente que queda en lista de espera.</p> <p>Saludos!</p> ",
  "type" : "event"
}, {
  "created" : 1461258595000,
  "id" : "230547132",
  "name" : "Meetup mensual - Abril",
  "status" : "past",
  "yes_rsvp_count" : 40,
  "venueName" : "Flowics",
  "venueAddress" : "Costa Rica 5546 Oficina 506",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/230547132/",
  "description" : "<p>Abril, fin del primer cuarto del año, y la sana costumbre de juntarnos para hablar sobre Javascript sigue intacta.</p> <p><br/>En este evento, <b>Flowics</b> nos abre las puertas para poder disfrutar de dos charlas muy interesantes:</p> <p><b>Realidad Virtual Programable en el Browser</b>, por Guido Leandro Maliandi</p> <p>Charla sobre el uso de tecnologías open source como three.js y voxel.js para generar ambientes 3D en el browser, creando componentes reprogramables en tiempo real, guardando versionados usando la API de Github Gist.</p> <p><b>Introducción a TypeScript</b>, por Hernán Rajchert</p> <p>Introducción a Typescript, contando sus ventajas y cómo hacer una migración de código existente sin morir en el intento.</p> <p>Como en todas las meetups les pedimos que hagan RSVP si están seguros que pueden asistir, y si hicieron RSVP y no pueden asistir, les pedimos que dejen el lugar para la gente que queda en lista de espera.</p> <p>Y si te quedaste afuera, te vas a perder de hablar con los miembros del meetup, pero no las charlas! Gracias a los chicos de <b>Acámica,</b> las charlas van a estar filmadas y subidas a Youtube en un par de días para que las puedan disfrutar infinitas veces.</p> <p>Saludos!</p> ",
  "type" : "event"
}, {
  "created" : 1464610828000,
  "id" : "231507734",
  "name" : "Meetup Mensual - Mayo",
  "status" : "past",
  "yes_rsvp_count" : 35,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/231507734/",
  "description" : "<p><img src=\"http://photos2.meetupstatic.com/photos/event/1/b/5/3/600_450546995.jpeg\" /></p> <p><b>Cierra el mes de Mayo pero se abre una nueva oportunidad para aprender sobre Ember.js</b></p> <p>En esta oportunidad nos abren las puertas los amigos de <a href=\"http://www.scvsoft.com\">SCV</a> y nos invitan las bebidas y la comida. Muchas Gracias!!! </p> <p>Como siempre, la modalidad es la misma, arrancamos 6:30 hs y para los que van llegando tenemos algo para tomar, comer y charlar. A las 7 hs (puntual) arranca la primer charla. </p> <p><b>Este mes tenemos 2 charlas muy buenas sobre Ember</b></p> <p><b>Ember 101 - Cruz 'Rock' Fernandez</b></p> <p>Ember es un framework ambicioso que está siendo usado ampliamente por seres humanos. En esta charla veremos un poco de su entorno de laburo (su consola), sus clases básicas (ember runtime) y un poco de su templating (HTML handlebars). Crearemos un componente y nos divertiremos (?) con su entorno de testing default (testem + QUnit)</p> <p><b>Reportes desde la trinchera - historias de los últimos años desarrollado con Ember - Miguel Madero</b></p> <p>Durante los últimos tres años Miguel ha estado trabajando con Ember, desarrollando aplicaciones para diferentes start-ups. En esta presentación el nos platicara de lo que ha funcionado bien y lo que no tanto. Las partes buenas de usar un framework como Ember y las áreas para mejorar. También nos platicara un poco de la historia del framework, su evolución, lo que Ember ha aprendido de otras comunidades, librerías y frameworks como Rust, React y Angular y lo que Ember ha aportado a NPM, Babel, tc39, React y Angular.</p> <p>Miguel Madero es un Emprendedor e Ingeniero en desarrollo de software, con experiencia construyendo sistemas y aplicaciones en múltiples industrias como salud, educación, televisión y comercio electrónico. Actualmente trabaja para Zenefits como UI Architect. Por los últimos años Miguel se ha especializado en desarrollo web. </p> <p><i><br/></i></p> <p><i>Recuerden que tenemos cupo para 40 personas máximo, por lo que si están anotados y saben con anticipación que no pueden venir, dense de baja así le dejan lugar a los que están en lista de espera! </i></p> <p><br/><img src=\"http://photos4.meetupstatic.com/photos/event/1/c/d/8/600_450547384.jpeg\" /></p> <p><b><br/></b></p> <p><b>Los esperamos!!</b></p> ",
  "type" : "event"
}, {
  "created" : 1467663015000,
  "id" : "232373001",
  "name" : "Meetup Mensual - Julio",
  "status" : "past",
  "yes_rsvp_count" : 40,
  "venueName" : "SCV",
  "venueAddress" : "Nicolas Repetto 1841",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/232373001/",
  "description" : "<p><img src=\"http://photos3.meetupstatic.com/photos/event/1/9/e/c/600_451806636.jpeg\" /></p> <p>Julio, mes frío y con muchas lluvias! Mejor nos juntamos con amigos y compartimos conocimientos sobre como crear librerías en Javascript.</p> <p>En esta oportunidad nos abren las puertas los amigos de <a href=\"http://scvsoft.com/\">SCV</a> y nos invitan las bebidas y la comida. Muchas Gracias!!! </p> <p>Luego del evento nos vamos a ir a cenar (lugar a definir) por lo cual quedan todos invitados (no está incluida en el evento y corre a cargo de cada uno).</p> <p>Ahora si la charla de este mes:</p> <p><b>Librerias 101: A Github, npm y el más acá - <a href=\"https://twitter.com/durancristhian\">Cristhian Duran</a></b></p> <p><br/>Si alguna vez te preguntaste como generar una herramienta de consola con Node, esta charla es para vos...</p> <p>Si alguna vez modificaste en el package.json la versión de tu libreria a mano según tu propio semver y querés dejar de hacerlo, esta charla es para vos...</p> <p>Si alguna vez te preguntaste que son los hooks de git, como autogenerar un changelog, un release a Github o publicar a npm siguiendo semver correctamente, esta charla es para vos...</p> <p>Spoiler: Puede que salgas teniendo ganas de jugar a la quiniela. Si no entendés por que, esta charla es para vos...</p> <p><br/><i>Recuerden que tenemos cupo para 40 personas máximo, por lo que si están anotados y saben con anticipación que no pueden venir, dense de baja así le dejan lugar a los que están en lista de espera! </i></p> <p><br/><i><b>Los esperamos!! </b><br/></i></p> ",
  "type" : "event"
}, {
  "created" : 1473168769000,
  "id" : "233911235",
  "name" : "Meetup Mensual - Septiembre",
  "status" : "past",
  "yes_rsvp_count" : 56,
  "venueName" : "Digital House",
  "venueAddress" : "Monroe 860",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/233911235/",
  "description" : "<p><b>No importa si te gusta Septiembre mas que Setiembre, lo que importa es javascript!!!</b></p> <p>A mal tiempo buena meetup? Estaaaa bieeeeennnnn!!!</p> <p>En esta oportunidad nos abren las puertas los amigos de <a href=\"https://www.digitalhouse.com/\"><b>Digital House</b></a> que nos inivitan a su casa y nos brindan las gaseosas y <a href=\"http://scvsoft.com/\"><b>SCV</b></a> que se pone con la picada de siempre y la birra. Muchas gracias a ambos por colaborar con estos eventos!</p> <p>Nos juntamos a las 19hs y la primer charla arranca a las 19:15hs.</p> <p><i>Luego del evento, los que quieran, podemos ir a cenar por libertador que hay un par de lugares copados. </i></p> <p><b><br/></b></p> <p><b>Ahora si las charlas de este mes:</b></p> <p><b>Introducción a GraphQL - Pablo Chiappetti</b></p> <p>GraphQL viene a desafiar a REST por el trono en cómo tus aplicaciones y tus APIs se comunican. La intención de esta charla es mostrar una introducción a esta tecnología, enfocándose en qué necesitamos para convertir cualquier server en un server GraphQL.</p> <p><b>Sobre el orador:</b></p> <p>Twitter: <a href=\"https://twitter.com/p4bloch\">@p4bloch</a></p> <p><b><br/></b></p> <p><b>Feature detection y Babel se hacen amigos -  Gabriel Montes</b></p> <p>Babel con sus plugins nos permite transpilar código que usa las últimas maravillas de JS pero... ¿Y si alguna característica de JS ya tiene soporte en la plataforma que estamos usando? Con esa premisa, y en unas horas, desarrollé babel-preset-latest-minimal y les voy a contar como funciona y lo simple que es.</p> <p><b>Sobre el orador:</b></p> <p>Twitter: <a href=\"https://twitter.com/gab_montes\">@gab_montes</a></p> <p>GitHub: <a href=\"https://github.com/gabmontes\">@gabmontes</a></p> <p>\n\n\n<b>Demystifying (JavaScript) Engines - Alejandro Oviedo</b></p> <p>¿Cómo funciona un motor de JavaScript? ¿Cuáles son sus componentes básicos? ¿Cómo medir su performance? ¿Qué es compilación JIT? son algunas de las preguntas que me hice para pensar en esta charla.</p> <p><b>Sobre el orador:</b></p> <p><br/>Twitter: <a href=\"https://twitter.com/a0viedo\">@a0viedo</a></p> <p><br/><b>Recuerden que si están anotados y saben con anticipación que no pueden venir, dense de baja así le dejan lugar a los que están en lista de espera!  </b></p> <p>Los esperamos!!</p> ",
  "type" : "event"
}, {
  "created" : 1475518073000,
  "id" : "234597321",
  "name" : "Meetup Mensual - Octubre",
  "status" : "past",
  "yes_rsvp_count" : 40,
  "venueName" : "Restorando HQ",
  "venueAddress" : "Vuelta de Obligado 1947, Piso 3, Buenos Aires",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/234597321/",
  "description" : "<p><img src=\"http://photos3.meetupstatic.com/photos/event/3/c/0/9/600_454755369.jpeg\" /></p> <p>En esta oportunidad agradecemos a Restorando que nos abre las puertas de su casa y nos invitan la bebida y picada!! 🍻</p> <p>La primer charla arrancará a las <b>19:15hs puntual</b></p> <p>Ahora sí, las charlas de este mes:</p> <p><b>Cómo estamos migrando nuestra API REST a GraphQL en Restorando - José Fresco</b></p> <p>En Restorando decidimos probar GraphQL y nos fue tan bien que las apps mobile ya lo están usando en Producción.Ahora queremos migrar nuestras web apps a React y como capa de conexión al backend empezamos usando Relay. Luego decidimos sacarlo y reemplazarlo por Redux. Te voy a contar cómo nos fue, qué nos salió bien, en qué nos equivocamos y qué tenemos planeado para el futuro.</p> <p><b>Sobre el orador:</b></p> <p>Twitter: <a href=\"https://twitter.com/jfresco82\">jfresco82</a><br/>Github: <a href=\"https://github.com/jfresco\">jfresco</a></p> <p>\n\n<b>Un tour por Team Fundation Service - German Kuber</b></p> <p>No es un IDE, que es todo lo demás. Visual Studio Team Services proporciona un conjunto de herramientas de colaboración en la nube potencia que trabajan con su editor o IDE existente, por lo que su equipo puede trabajar eficazmente en proyectos de software de todas las formas y tamaños.</p> <p><br/>Twitter: <a href=\"https://twitter.com/germankuber\">germankuber</a></p> <p><br/><b>Recuerden que si están anotados y saben con anticipación que no pueden venir, dense de baja así le dejan lugar a los que están en lista de espera!  </b></p> <p>Los esperamos!!</p> ",
  "type" : "event"
}, {
  "created" : 1480074820000,
  "id" : "235817630",
  "name" : "Meetup mensual - Noviembre (Última del año!)",
  "status" : "past",
  "yes_rsvp_count" : 47,
  "venueName" : "Medallia",
  "venueAddress" : "Humboldt 1550, Oficina 313",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/235817630/",
  "description" : "<p><img src=\"http://photos2.meetupstatic.com/photos/event/8/1/5/5/600_456453109.jpeg\" /></p> <p>Otro año más que se va, otro año que pasamos juntos como comunidad. En lugar de ponernos sentimentales, vamos a hacer lo que más nos gusta: juntarnos a c̶o̶m̶e̶r̶ aprender!</p> <p><br/>Este evento no hubiese sido posible sin la ayuda de <b>Medallia</b>, que nos provee de lugar, comida, y filmación de las charlas. También habrá una mesa dulce de fin de año provista por las chicas de <a href=\"https://www.instagram.com/tiendadebombas/\"><b>@tiendadebombas</b></a>. Muchas gracias a ambos!</p> <p>Este mes tenemos a dos miembros de nuestra comunidad que propusieron estas dos muy buenas charlas:</p> <p><b>Tu código puede ser mejor y puedo demostrarlo matemáticamente</b>, por Martín Valdes de Leon</p> <p>Programación funcional. El último grito de la moda, pero solo para aquellos dispuestos a sumergirse en la terminología. No más. Sin matemática ni formulas, la programación funcional ya esta entre nosotros, y ha llegado para quedarse. Con esta charla espero sacar a la luz distintos conceptos que ya manejamos en nuestro día a día, y demostrar que detrás de las palabras raras y los diagramas se esconde una herramienta más para hacer nuestro código más simple.</p> <p>Sobre el orador: <a href=\"https://github.com/mvaldesdeleon\" class=\"linkified\">https://github.com/mvaldesdeleon</a></p> <p>---</p> <p><b>Descubriendo Canvas</b>, por Ricardo Schifini</p> <p>Canvas es un elemento de HTML5 que no suele ser muy utilizado. Dare una introduccion de alguno de los metodos y mostrare algunos ejemplos de lo que se puede lograr.</p> <p>Sobre el orador:<br/>Soy Dr. en Fisica, padre de tres y nerd. Empece a programar en una TRS-80 (<a href=\"http://oldcomputers.net/trs80pc1.html\" class=\"linkified\">http://oldcomputers.net/trs80pc1.html</a>) y desde ahi no pare. He programado en Lenguaje de Maquina, Basic, QuickBasic, LabView, SQL, Matlab, JavaScript y R.<br/>Me pueden encontrar respondiendo pregruntas en SO sobre R, JS y Matlab.</p> <p>---</p> <p><b>Recuerden que si están anotados y saben con anticipación que no pueden venir, dense de baja así le dejan lugar a lxs que están en lista de espera! </b></p> <p>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1486736642000,
  "id" : "237609108",
  "name" : "Meetup mensual - Febrero 2017",
  "status" : "past",
  "yes_rsvp_count" : 60,
  "venueName" : "Southworks",
  "venueAddress" : "Perú 375 1 piso. (Perú y Belgrano)",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/237609108/",
  "description" : "<p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/d/a/e/1/600_458216033.jpeg\" /></p> <p><b><i>Comenzamos el año con muchas novedades y un gran evento!! </i></b> </p> <p>En esta oportunidad nos abren las puertas los amigos de <a href=\"http://southworks.com/\">Southworks</a>. Muchas gracias por acompañarnos con estos eventos!</p> <p><b><i>Meetup.js este año se vuelve más solidaria y necesitamos la colaboración de todos. Si bien la idea es mantener los eventos gratuitos queremos pedirles si pueden traer un alimento no perecedero que será donado este mes a la <a href=\"http://fundacionsi.org.ar/\">fundacionsi.org.ar</a> <br/></i></b></p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/d/b/e/9/600_458216297.jpeg\" /></p> <p><a href=\"https://www.youtube.com/watch?v=gExuhvbiEz4\" class=\"embedded\">https://www.youtube.com/watch?v=gExuhvbiEz4</a></p> <p><i>Nos juntamos a las 19hs y la primer charla arranca a las 19:15hs</i> </p> <p><b>Lightning Talk:</b></p> <p>Incorporamos este formato de presentaciones muy cortas (5 minutos máximos) para que se puedan anotar el día del evento y contar alguna novedad, proyecto, etc que tengan.</p> <p><b>Ahora si las charlas de este mes:</b> </p> <p><b>Rompiendo el mundo binario con Vue.js - Ignacio Anaya</b></p> <p><br/>Con el release de su version 2,  <a href=\"https://vuejs.org/\">Vue.js</a> quedo mas consolidado que nunca. Es sin duda una revelación el mundo MV* client side y se posiciona como una de las alternativas mas prometedoras, peleando con gigantes de la industria como React y Angular 2. Voy a mostrarte la simpleza y el poder de este framework para que puedas considerarlo en tu proximo proyecto.</p> <p>Sobre el orador:</p> <p>Full stack software engineer, mentor and field hockey player.</p> <p>Twitter: <a href=\"https://twitter.com/@ianaya89\">@ianaya89 </a></p> <p><br/>Sitio: <a href=\"http://stackoverflow.com/users/4195328/ianaya89\">StackOverflow</a> </p> <p><b>Lo que viene en fútbol de primera - Next.js 2.0 - Dan Zajdband</b></p> <p>&lt;a&gt;Next.js&lt;/a&gt; ofrece una nueva forma de encarar aplicaciones web universales. Desde el lanzamiento del framework en Octubre aprendimos mucho acerca del uso que le da la comunidad al proyecto y se vienen grandes cambios para la segunda versión. Vamos a repasar la filosofía detrás de next.js para quien no lo conoce e introducir las nuevas features.</p> <p>Sobre el orador</p> <p><br/>Twitter: <a href=\"https://twitter.com/@impronunciable\">@impronunciable</a></p> <p>Sitio: <a href=\"https://zajdband.com/\">zajdband.com</a></p> <p><b>Recuerden que si están anotados y saben con anticipación que no pueden venir, dense de baja así le dejan lugar a los que están en lista de espera!  </b></p> <p><br/>Los esperamos!!<b><br/></b></p> ",
  "type" : "event"
}, {
  "created" : 1488406935000,
  "id" : "238094647",
  "name" : "Meetup mensual - Marzo 2017",
  "status" : "past",
  "yes_rsvp_count" : 50,
  "venueName" : "Restorando HQ",
  "venueAddress" : "Vuelta de Obligado 1947, Piso 3, Buenos Aires",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/238094647/",
  "description" : "<p>¡Se viene el meetup de Marzo!</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/9/c/f/600_458983471.jpeg\" /></p> <p>\n\n\nSaludos JavaScripters!, aquí estamos una vez más para anunciar un nuevo evento. En esta oportunidad nos vamos a reunir en las oficinas de nuestros amigos de <b>Restorando</b>, a quienes les agradecemos por abrirnos las puertas.</p> <p><b>Les recordamos que <i>este año Meetup.js tiene el objetivo de ayudar a las personas que más lo necesitan, por lo que les pedimos que se acerquen al evento con un alimento no perecedero que será donado a Fundación Sí</i></b></p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/d/b/e/9/600_458216297.jpeg\" /></p> <p><a href=\"https://www.youtube.com/watch?v=gExuhvbiEz4\" class=\"embedded\">https://www.youtube.com/watch?v=gExuhvbiEz4</a></p> <p>\n\n\nTambién vamos a tener <i>lightning talks</i>. Si te gustaría dar una, podés aplicar por medio de <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSeL_NIezQZmT5VBcCJZ3UWVKY4KTv6yWpPQQvoPKpV09CnuJg/viewform\"><b>este formulario</b></a></p> <p>\n\n\nLas charlas de este mes van a ser:</p> <p><b>🔊 Progressive Web Apps con Ember</b> - Samanta de Barros</p> <p><a href=\"https://images.ampower.me/article/483223\" class=\"linkified\">https://images.ampower.me/article/483223</a></p> <p>Veremos qué es una PWA y cómo podemos desarrollar una aplicación web para móviles que aproveche las nuevas características de los navegadores más populares. Qué cosas nos ofrecen los mismos hoy para poder ofrecer una experiencia de usuario de primer nivel sin necesidad de instalar una app. Y cómo podemos, con Ember, desarrollar una aplicación web de estas características.</p> <p><i>Sobre la oradora:</i></p> <p><i>Desarrolladora de software desde hace varios años, actualmente trabajo con tecnologías web, desarrollando principalmente en Ruby y Javascript (Ember).</i></p> <p><i>Twitter: @<a href=\"https://twitter.com/sami_dbc\">sami_dbc</a></i></p> <p><b>🔊 Elm for World Peace </b>- Ainu Jorge Chambeaud Helguera</p> <p><img src=\"https://cdn-images-1.medium.com/max/720/1*I-3kbXzEIAPAPEGiMcAs0A.png\" /></p> <p>Una breve introducción a Elm contada por un programador FrontEnd del clan react/redux. Si bien la charla no es sobre JS, esta dedicada a programadores JS y preparada por un programador JS. La idea es discutir algunas de las problemáticas que enfrenta la programación FrontEnd moderna y como el paradigma funcional y el lenguaje elm en particular se proponen resolverlos. Siguiendo el espíritu de elm, vamos a hablar de los aspectos prácticos de la programación funcional, dejando de lado su aspecto mas académico (no hablaremos sobre category theory, monads, functors, etc).</p> <p>Principales temas a tratar:</p> <p>- Primeras impresiones sobre el lenguaje</p> <p>- Programación funcional blanca y pura</p> <p>- Programando sin nulls ni undefined</p> <p>- Type safetySide effects</p> <p>- Elm Architecture</p> <p><i>Sobre el orador:</i></p> <p><i>Twitter: @<a href=\"https://github.com/ajchambeaud\">ajchambeaud</a></i></p> <p>\n\n\n<i>Recuerden liberar el lugar si saben que no van a poder asistir</i>. Los esperamos a todos con ganas de compartir otro gran encuentro!</p> ",
  "type" : "event"
}, {
  "created" : 1490983429000,
  "id" : "238860580",
  "name" : "Meetup Mensual - Abril 2017",
  "status" : "past",
  "yes_rsvp_count" : 76,
  "venueName" : "Mercadolibre",
  "venueAddress" : "Alem 518 piso 11",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/238860580/",
  "description" : "<p>Llega un nuevo meetup en el mes de Abril!</p> <p><img src=\"https://secure.meetupstatic.com/photos/event/7/1/2/4/600_459928964.jpeg\" /></p> <p>Esta vez nos prestan sus oficinas los amigos de <b>Mercado Libre</b>, a quienes les agradecemos mucho por la buena predisposición que tienen siempre.</p> <p>Les recordamos que <i>este año Meetup.js tiene el objetivo de ayudar a las personas que más lo necesitan, por eso e</i><i>ste mes estaremos colaborando con la gente afectada por las inundaciones en Comodoro Rivadavia. </i><i>Como algunos sabrán y otros quizas no, se están viviendo dias muy complicados debido a las inundaciones y fuertes tormentas de hace algunas semanas.</i></p> <p><i><b>Por esto les pedimos que, como entrada al evento, traigan pañales, bidones de agua y/o elementos de limpieza. que luego los estaremos llevando a la Casa de Chubut.</b></i></p> <p>Seguimos con el sistema de <i>lightning talks, </i>por lo que si te gustaría dar una, podés aplicar por medio de <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSeL_NIezQZmT5VBcCJZ3UWVKY4KTv6yWpPQQvoPKpV09CnuJg/viewform\"><b>este formulario</b></a></p> <p>Las charlas de este mes van a ser:</p> <p><b>Cross-platform Desktop Apps con Electron - </b>Miguel Barocchi</p> <p>Desktop apps: NOT DEAD. Un vistazo general sobre Electron: la tecnología que nos permite desarrollar aplicaciones desktop coss-platform utilizando JavaScript, HTML y CSS!<br/>¿Qué es? ¿qué tecnología hay de fondo? ¿qué posibilidades ofrece? Además: comparación con otras tecnologías similares. Pros y Cons. Ejemplos de posibles aplicaciones y una breve introducción con los pasos para crear una app desde cero con esta tecnología.</p> <p><i>Sobre el orador:</i></p> <p><i>Soy desarrollador web desde hace 10 años. Actualmente soy full stack dev en SCVSoft.</i></p> <p><i>Twitter: <a href=\"https://twitter.com/baromigue\">@baromigue</a></i></p> <p><b>Firebase, una nueva forma de mejorar tus aplicaciones </b>- Laura Morinigo</p> <p><br/>Firebase es la herramienta multiplataforma que ofrece Google para que el programador cree aplicaciones exitosas y de alta calidad. En esta charla exploraremos algunas de sus funcionalidades como: database real time, authentication y hosting, al mismo tiempo que mostraremos un ejemplo para una aplicación web explorando su integración con javascript.</p> <p><br/>Sobre la oradora:</p> <p>Fullstack developer, manager @GDG Río de La Plata y Women Tech Makers, profesora de MeanJS en Escuela Dev Rock.</p> <p><br/><i>Twitter: <a href=\"https://twitter.com/lalarayada\">@lalarayada</a></i></p> <p>\n\n\n<i>Recuerden liberar el lugar si saben que no van a poder asistir</i>. Los esperamos a todos con ganas de compartir otro gran encuentro!</p> ",
  "type" : "event"
}, {
  "created" : 1492457694000,
  "id" : "239281033",
  "name" : "JavaScript 101 #1",
  "status" : "past",
  "yes_rsvp_count" : 42,
  "venueName" : "ComunidadIT",
  "venueAddress" : "SCALABRINI ORTIZ 582, oficina 114",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/239281033/",
  "description" : "<p><img src=\"https://secure.meetupstatic.com/photos/event/d/6/6/9/600_460134889.jpeg\" /></p> <p>JavaScript 101 es un workshop inicial para todos los que están dando sus primeros pasos en programación o con el lenguaje y poder acompañarlos en el aprendizaje para que sea más fácil. Si estás en esta situación, este workshop es para vos!!</p> <p>Le damos las gracias a <a href=\"http://www.comunidadit.org/\">Comunidad IT</a> que nos acompaña en estos eventos. </p> <p><b>El ingreso es de 9:30 a 10 hs y tiene una duración de 3 horas. Les pedimos que por favor sean puntuales.</b></p> <p><b>¿Qué vamos a ver y hacer?</b></p> <p>A lo largo del workshop vamos a ver los fundamentos de la programación, la historia del lenguaje, ¿qué es y donde puedo correr JavaScript?, variables, tipos de datos, distintos tipos de estructuras y operadores utilizando el lenguaje en distintos ambientes. </p> <p>Podes ver el programa más detallado en el <a href=\"https://github.com/javascript-101/javascript-101\">siguiente link</a>.</p> <p><b>Requisitos:</b></p> <p>• Traer tu computadora, en caso de no tener una podemos buscar algún compañero/a</p> <p>• Tener <a href=\"https://nodejs.org/\">Node.js</a> instalado. Pueden <a href=\"https://nodejs.org/es/download/\">bajarlo/instalar desde aquí</a></p> <p>• Editor de texto como <a href=\"https://www.sublimetext.com/\">Sublime</a>, <a href=\"https://atom.io/\">Atom</a> o <a href=\"https://code.visualstudio.com/\">Visual Studio Code</a></p> <p>• Ganas de aprender y buena onda! </p> <p>Si quieren preguntar o sugerir algo pueden hacerlo utilizando el <a href=\"http://slack.meetupjs.com.ar/\">slack de la comunidad</a> en el canal de JavaScript 101.</p> <p>Pueden traer mate, bebida o algo para picar y compartimos entre todos (lejos de las compus). </p> <p><br/>Los esperamos!!</p> ",
  "type" : "event"
}, {
  "created" : 1494852642000,
  "id" : "239998577",
  "name" : "Meetup Mensual - Mayo 2017",
  "status" : "past",
  "yes_rsvp_count" : 50,
  "venueName" : "Flowics",
  "venueAddress" : "Costa Rica 5546 Oficina 506",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/239998577/",
  "description" : "<p>Es Mayo y seguimos con la buena costumbre de juntarnos para charlar!</p> <p>Esta vez nos prestan sus oficinas la gente de <b>Flowics</b>, a quienes les agradecemos mucho por brindarnos el espacio como ya lo han hecho en otras oportunidades.</p> <p>Les recordamos que <i>este año Meetup.js tiene el objetivo de ayudar a las personas que más lo necesitan, por eso e</i><i>ste mes estaremos colaborando con la Asociación Civil La Vereda de Enfrente. El objetivo de esta institución es prevenir y brindar asistencia a familias que sufren el flagelo de las drogas y son vulnerables por su contexto social. Entre las actividades que realizan se destacan la guardería infantil para los hijos de personas que están en rehabilitación, entrega mensual de ayuda alimentaria con bolsitas de comida e inauguraron un comedor comunitario que brinda cena los días sábado a más de 50 familias. También tienen un grupo de mujeres donde trabajan y concientizan sobre la problemática de la violencia de género.</i></p> <p><i><b>Por esto les pedimos que, como entrada al evento, traigan alimentos no perecederos que luego los estaremos llevando a la fundación.</b></i></p> <p><br/>Seguimos con el sistema de <i>lightning talks, </i>por lo que si te gustaría dar una, podés aplicar por medio de <b><a href=\"https://docs.google.com/forms/d/e/1FAIpQLScSwVJMOLoEocOqxr2LJex14xpNdMf1ehSQV9SbFOi1kn8VQA/viewform?usp=sf_link\">este formulario</a></b></p> <p>Las charlas de este mes van a ser:</p> <p><b>Flow(type) for the Brave &amp; True - </b>Mariano Cortesi</p> <p>En esta charla veremos las características salientes de <a href=\"https://github.com/meetupjs-ar/charlas/issues/flowtype.org\">flowtype.org</a> contadas a partir de la experiencia en agregarlo al codebase de <a href=\"https://github.com/meetupjs-ar/charlas/issues/flowics.com\">Flowics</a>.</p> <p>Entre los temas a tratar vamos a ver:</p> <p>• Una breve intro a flow</p> <p><br/>• Por qué flow y no typescript en el caso de estudio</p> <p><br/>• Real world problems dentro del stack donde fue aplicado (node + react + redux + immutable.js + etc)</p> <p><br/><i>Sobre el orador:</i></p> <p><br/><i>Principal Software Architect y Co-Founder en Flowics</i></p> <p><i>Twitter: <a href=\"https://twitter.com/mcortesi5\">@mcortesi5</a></i></p> <p><b>Navegación en React Native, opciones para no caer en la locura </b>- Eleonora Lester </p> <p><br/>Elegir la librería de navegación en un proyecto React Native es una tarea importante y a la vez complicada por la variedad de opciones dentro de un escenario muy cambiante por ser una tecnología relativamente nueva.</p> <p>En esta charla vamos a evaluar y comparar dos de las opciones más populares: React Native Router Flux y React Native Navigation (wix)</p> <p>Sobre la oradora:</p> <p>Front end developer at GCBA</p> <p><br/><i>Twitter: <a href=\"https://twitter.com/lele_lester\">@lele_lester</a></i></p> <p>\n\n\n<i>Recuerden liberar el lugar si saben que no van a poder asistir</i>. Los esperamos a todos con ganas de compartir otro gran encuentro!</p> ",
  "type" : "event"
}, {
  "created" : 1497531343000,
  "id" : "240813118",
  "name" : "Meetup mensual - Junio 2017",
  "status" : "upcoming",
  "yes_rsvp_count" : 120,
  "venueName" : "Medallia",
  "venueAddress" : "Humboldt 1550, Oficina 313",
  "group" : "Meetup-js",
  "link" : "https://www.meetup.com/Meetup-js/events/240813118/",
  "description" : "<p>Llegamos a mitad de año y el frío no es excusa para no juntarnos!</p> <p><br/>Este mes nos recibe la gente de  <a href=\"http://www.medallia.com/\">Medallia</a> en sus oficinas de Palermo, a quienes les agradecemos mucho por brindarnos el espacio.</p> <p>Les recordamos que <i>este año <a href=\"http://meetupjs.com.ar/\">Meetup.js</a> tiene el objetivo de ayudar a las personas que más lo necesitan, por eso este mes estaremos colaborando con la Asociación Civil La Vereda de Enfrente. El objetivo de esta institución es prevenir y brindar asistencia a familias que sufren el flagelo de las drogas y son vulnerables por su contexto social. Entre las actividades que realizan se destacan la guardería infantil para los hijos de personas que están en rehabilitación, entrega mensual de ayuda alimentaria con bolsitas de comida e inauguraron un comedor comunitario que brinda cena los días sábado a más de 50 familias. También tienen un grupo de mujeres donde trabajan y concientizan sobre la problemática de la violencia de género.</i></p> <p><i><b>La entrada al evento es</b> una leche larga vida, cacao y/o galletitas (preferentemente dulces) que luego los estaremos llevando a la fundación. No se preocupen, si llegan con las manos vacias, pueden comprarlo en el &lt;a&gt;Dia que está al lado de Medallia&lt;/a&gt;.</i></p> <p>Seguimos con el sistema de <i>lightning talks, </i>por lo que si te gustaría dar una, podés aplicar por medio de<b> <a href=\"https://drive.google.com/open?id=1-b5CkGyL8UUuD_tL0DLcCMpv4Frwx_o7a4362uHBmi4\">este formulario</a></b> (<a href=\"https://drive.google.com/open?id=1-b5CkGyL8UUuD_tL0DLcCMpv4Frwx_o7a4362uHBmi4\"><a href=\"https://drive.google.com/open?id=1-b5CkGyL8UUuD_tL0DLcCMpv4Frwx_o7a4362uHBmi4\" class=\"linkified\">https://drive.google.com/open?id=1-b5CkGyL8UUuD_tL0DLcCMpv4Frwx_o7a4362uHBmi4</a></a>)</p> <p>Las charlas de este mes van a ser:</p> <p><b> AST a la vista baby - Leonardo Garcia Crespo</b></p> <p>Babel, ESlint, JScodeshift, Prettier, parecen ser herramientas que funcionan mágicamente en nuestro código. Hacen (mayormente) lo que queremos que hagan, y nunca nos atrevemos a mirar por dentro para saber qué es lo que hacen. ¿Cómo funcionan? Vamos a ver la pieza fundamental del rompecabezas, el Abstract Syntax Tree, o AST. Qué es, para qué sirve, y cómo podemos manipularlo para lograr cosas útiles, copadas y hasta muy locas en las distintas herramientas.</p> <p>Después de esta charla vas a perderle el miedo a los AST y vas a poder impresionar a tu mamá con el plugin de Babel que vas a saber hacer.</p> <p><i>Sobre el orador:</i> </p> <p>Frontend developer @Match.com. All things React. Me gusta estar siempre aprendiendo cosas nuevas. Co-organizador de Meetup.js. También toco el bajo y hago chistes malos.</p> <p><i>Twitter: <a href=\"https://twitter.com/leogcrespo\">@leogcrespo</a></i></p> <p><b>Arquitecturas Empresariales escalables Front-end - Andres Mijares</b></p> <p>Describir como organizar la arquitectura de nuestras aplicaciones basado en los atributos de calidad del negocio.</p> <p>Sobre el orador: Venezolano, Ingeniero en Información con +12 años de experiencia en la industria, actualmente Director de Desarrollo Web en Shiftgig.</p> <p><i>Twitter:  <a href=\"https://twitter.com/andresmijares25\">@andresmijares25</a></i></p> <p>Para este evento les vamos a pedir a quienes se registren su número de DNI, ya que es solicitado por motivos de seguridad por Medallia.</p> <p><i>Recuerden liberar el lugar si saben que no van a poder asistir</i>. Los esperamos a todos con ganas de compartir otro gran encuentro! </p> ",
  "type" : "event"
}, {
  "created" : 1429633836000,
  "id" : "221997608",
  "name" : "Primer BeerJS en Buenos Aires!",
  "status" : "past",
  "yes_rsvp_count" : 36,
  "venueName" : "Puerta Roja",
  "venueAddress" : "Chacabuco 733",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/221997608/",
  "description" : "<p>El lunes 4 de Mayo vamos a estar haciendo la primer BeerJS en Buenos Aires en Puerta Roja, un bar icónico de San Telmo, con la idea de empezar a conocernos, hablar de la vida y por supuesto de JavaScript, y embriagarnos con un poco del mejor lubricante social disponible en Buenos Aires.</p> <p>Cualquier duda respondan a la cadena. No hace falta anunciarse, pueden venir con quien quieran, y los esperamos! La meetup cuenta con un formato destructurado por lo que no va a haber talks ni ningún tipo de cronograma otro que pasarla bien. Arranca oficialmente a las 7 pero puerta está abierto desde mucho más temprano, así que por ese lado tampoco habría inconvenientes.</p> <p>Les agradecemos si pueden ayudar a difundir el evento, ya que es nuestra primera juntada. Pueden usar esta imágen: <img src=\"http://i.imgur.com/ZETjBPc.png\" /></p> ",
  "type" : "event"
}, {
  "created" : 1432440653000,
  "id" : "222742132",
  "name" : "Beer.js Buenos Aires #2!  Jerome Beer Republic, Palermo",
  "status" : "past",
  "yes_rsvp_count" : 39,
  "venueName" : "Jerome \"The Beer Republic\"",
  "venueAddress" : "Malabia 1401, Palermo",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/222742132/",
  "description" : "<p><b>Se viene la segunda meetup de BeerJS en Buenos Aires! </b></p> <p><br/>Esta vez nos vamos a estar juntando en un barcito por Palermo que se especializa en la cerveza artesanal. No te lo podés perder!</p> <p>\n\n\nAnotate!</p> ",
  "type" : "event"
}, {
  "created" : 1435587416000,
  "id" : "223576560",
  "name" : "Beer.js Buenos Aires #3! Gibraltar, San Telmo",
  "status" : "past",
  "yes_rsvp_count" : 27,
  "venueName" : "Gibraltar Bar",
  "venueAddress" : "Peru 895, San Telmo",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/223576560/",
  "description" : "<p>Ya saben como es esto. Esta vez nos tocó The Gibraltar, un bar con algunas birras artesanales, sobre todo algunas stout muy recomendables. Y los nerds de siempre, por supuesto. Los esperamos! (O bueno, nos esperan, puntualidad pendiente)</p> <p><a href=\"http://www.thegibraltarbar.com\" class=\"linkified\">http://www.thegibraltarbar.com</a></p> ",
  "type" : "event"
}, {
  "created" : 1437678422000,
  "id" : "224125683",
  "name" : "Beer.js BA #4: Frank's Bar",
  "status" : "past",
  "yes_rsvp_count" : 39,
  "venueName" : " Frank's Bar Buenos Aires",
  "venueAddress" : "Arevalo 1443",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/224125683/",
  "description" : "<p>Pocas veces fuí a bares tan memorables como Frank's en Palermo. Está ambientado como un speakeasy, establecimientos ilegales que vendian alcohol durante la era de la prohibición en USA. Tienen una \"contraseña\" para dejarte entrar que cambia todos los meses. Es fácil de inferir, ya que publican tweets con hints sobre la contraseña para ayudarte a adivinarla.</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/c/4/2/a/600_440090218.jpeg\" /></p> <p>Una vez dentro encontrás buena música, una linda ambientación, y a otros miembros de Beer.js.</p> <p>En esta oportunidad nos estamos juntando el 13 de Agosto. Falta bastante, pero está bueno organizarnos con tiempo para poder ir planeando la fecha con tiempo. Como siempre, los recibiremos con stickers y ganas de que alguno pague las papas.</p> <p>Inviten a sus amigos y amigas nerds! Bueno, no tienen que ser sus amigos necesariamente. Con que se pongan para las papas alcanza.</p> <p>console.warn('tienen un <a href=\"https://faceapps.chab.la/images/dress-code.jpg\">código de vestimenta</a>');</p> ",
  "type" : "event"
}, {
  "created" : 1440705721000,
  "id" : "224930644",
  "name" : "Beer.js BA #5 -- Temple Bar Palermo",
  "status" : "past",
  "yes_rsvp_count" : 34,
  "venueName" : "The Temple Bar",
  "venueAddress" : "Godoy Cruz 1853, Palermo",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/224930644/",
  "description" : "<p>Buenas gente! El martes hacemos una BeerJS en temple bar sobre godoy cruz entre honduras y el salvador, a cómodos metros de juan b. justo.</p> <p>Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1444348208000,
  "id" : "225933805",
  "name" : "Beer.js #6! Martes 13 en Puerta Roja",
  "status" : "past",
  "yes_rsvp_count" : 32,
  "venueName" : "Puerta Roja",
  "venueAddress" : "Chacabuco 733",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/225933805/",
  "description" : "<p>Hola, el martes nos juntamos en puerta roja en nuestro sexto aniversario. Los esperamos!</p> ",
  "type" : "event"
}, {
  "created" : 1447868122000,
  "id" : "226862231",
  "name" : "Beer.js #7! Jueves 19 en Microsoft/The Kilkenny Irish Pub & Restaurant",
  "status" : "past",
  "yes_rsvp_count" : 11,
  "venueName" : "The Kilkenny",
  "venueAddress" : "Marcelo T. de Alvear 399 and Reconquista",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/226862231/",
  "description" : "<p>21:30hs - The Kilkenny Irish Pub &amp; Restaurant - <a href=\"https://www.google.com.ar/maps/place/Marcelo+T.+de+Alvear+399,+C1058AAA+CABA/@-34.5960679,-58.3752161,17z/data=%213m1%214b1%214m2%213m1%211s0x95bccacabe36206f:0x2b04d65e35e06848?hl=es\">Marcelo T de Alvear 399</a></p> <p><br/>Este mes festejamos el segundo aniversario de <a href=\"http://www.meetup.com/meetup-js\">Meetup.js</a> junto a los amigos de <a href=\"http://www.meetup.com/banodejs/\">BAnodejs</a> y quienes les hablan en un evento que promete ser una fiesta.</p> <p>Tras el</p> <p><a href=\"https://eventioz.com.ar/e/thorsten-lorenz-en-argentina-banodejs-meetupjs-bee\">Meetup.js en Microsoft</a></p> <p>nos mudamos a </p> <p><a href=\"https://www.facebook.com/thekilkennyba/?rf=139273659479692\">The Kilkenny Irish Pub &amp; Restaurant</a></p> <p> para tomar unas cervezas en un espacio más distendido.</p> <p>No es requisito haber participado del evento en las oficinas de Microsoft para asistir al Beer.js en Kilkenny.</p> <p><br/>Para aprender más sobre el Meetup.js en Microsoft y anotarse pueden usar el siguiente link:</p> <p><br/><a href=\"https://eventioz.com.ar/e/thorsten-lorenz-en-argentina-banodejs-meetupjs-bee\"><a href=\"https://eventioz.com.ar/e/thorsten-lorenz-en-argentina-banodejs-meetupjs-bee\" class=\"linkified\">https://eventioz.com.ar/e/thorsten-lorenz-en-argentina-banodejs-meetupjs-bee</a></a></p> ",
  "type" : "event"
}, {
  "created" : 1453125413000,
  "id" : "228174941",
  "name" : "Beer.js #8! Martes 19 de Enero: Abrazamos el año en OnTap Palermo",
  "status" : "past",
  "yes_rsvp_count" : 30,
  "venueName" : "ON TAP Palermo",
  "venueAddress" : "Costa Rica 5527",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/228174941/",
  "description" : "<p>Hola gente, mañana le damos la bienvenida al año en On Tap. Es un bar en Palermo sobre Costa Rica, a metros de Juan B. Justo. Los esperamos!</p> <p>\n\n\n<img src=\"http://photos4.meetupstatic.com/photos/event/b/7/a/f/600_446027023.jpeg\" /></p> ",
  "type" : "event"
}, {
  "created" : 1465827502000,
  "id" : "231859849",
  "name" : "Beer.js #9! Jueves 16 de Junio, Temple Bar Palermo",
  "status" : "past",
  "yes_rsvp_count" : 40,
  "venueName" : "The Temple Bar",
  "venueAddress" : "Godoy Cruz 1853, Palermo",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/231859849/",
  "description" : "<p>Buenas.</p> <p>Este jueves vuelve Beer.js después de un largo invierno birrero.</p> <p>Si quieren cagarse de frio con nosotros, ya saben. El jueves en Temple Bar. Godoy Cruz 1853, a la vuelta de Juan B. Justo.</p> <p><br/>Abrazo!</p> <p>Nico @nzgb</p> ",
  "type" : "event"
}, {
  "created" : 1470760610000,
  "id" : "233234668",
  "name" : "Beer.js #10! La vuelta de la puerta",
  "status" : "past",
  "yes_rsvp_count" : 7,
  "venueName" : "Puerta Roja",
  "venueAddress" : "Chacabuco 733",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/233234668/",
  "description" : "<p>El viernes hacemos la décima edición de Beer.js en Puerta Roja.</p> <p>Birra!</p> ",
  "type" : "event"
}, {
  "created" : 1472064149000,
  "id" : "233593160",
  "name" : "Beer.js #11 en On Tap, Palermo",
  "status" : "past",
  "yes_rsvp_count" : 27,
  "venueName" : "ON TAP Palermo",
  "venueAddress" : "Costa Rica 5527",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/233593160/",
  "description" : "<p>Beer.js en ontap palermo el viernes que viene! 🍻🍻🍻</p> ",
  "type" : "event"
}, {
  "created" : 1475863342000,
  "id" : "234698098",
  "name" : "Beer.js #12! Blue Dog Palermo",
  "status" : "past",
  "yes_rsvp_count" : 27,
  "venueName" : "Blue Dog",
  "venueAddress" : "Gorriti 4758, C1414BJL CABA",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/234698098/",
  "description" : "<p>Nos juntamos el Miercoles 12 de Octubre! </p> ",
  "type" : "event"
}, {
  "created" : 1490644410000,
  "id" : "238752401",
  "name" : "Beer.js #13! Dársena Bar Palermo",
  "status" : "past",
  "yes_rsvp_count" : 51,
  "venueName" : "Dársena Bar",
  "venueAddress" : "Cabrera 4354",
  "group" : "beerjs-ba",
  "link" : "https://www.meetup.com/beerjs-ba/events/238752401/",
  "description" : "<p><img src=\"http://photos1.meetupstatic.com/photos/event/5/e/7/9/600_459504185.jpeg\" /></p> <p>Se viene un nuevo beer.js para todos y todas!! El viernes 28/4 nos juntamos en <a href=\"https://www.darsenabar.com/\">Dársena Bar</a> (Palermo) para otra noche inolvidable. Que noche nos espera Teté!! </p> <p>Nos vemos!!</p> ",
  "type" : "event"
} ]